{
  "backend/main.mo": "Main backend actor implementing user profiles, agent registry with pre-populated agents (Skippy, GLaDOS, Robby, etc.), debate state management, file metadata storage, and access control using mixins for authorization and blob storage.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including React components, hooks, configuration, and utilities for a debate/agent management system with speech recognition and Internet Identity authentication.",
  "frontend/.env": "Local development environment configuration specifying backend canister ID and DFX network set to 'local'.",
  "frontend/.env.production": "Production environment configuration with backend canister ID and DFX network set to 'ic' for Internet Computer mainnet.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light and dark modes using a neutral grayscale palette suitable for technical infrastructure UI.",
  "frontend/index.html": "HTML entry point for the application titled 'The Gang' with a root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Main React application component with three tabs (Boardroom, Sensory Cortex, Swarm Health), Internet Identity authentication, debate management with voice/text input, transcript download, and agent registry display.",
  "frontend/src/components/AgentRegistryTable.tsx": "Agent registry table displaying system infrastructure vitals with toggle switches for agent status, memory usage progress bars, diagnostics modal, and a reset agents button.",
  "frontend/src/components/CrashLogModal.tsx": "Dialog modal component displaying agent diagnostics and telemetry information with monospace terminal-style formatting in green/black theme.",
  "frontend/src/components/DebateDisplay.tsx": "Displays the boardroom debate transcript with speaker badges, text-to-speech controls, and emergency mode indicator. Auto-scrolls to show new messages and parses transcript lines by speaker (Skippy, GLaDOS, Robby, SYSTEM, User).",
  "frontend/src/components/InterruptButton.tsx": "Provides a button to interrupt/stop an active debate by canceling speech synthesis and calling the backend abort mutation.",
  "frontend/src/components/PushToTalkButton.tsx": "Implements push-to-talk speech recognition with visual feedback, processing transcripts when recording stops and preventing duplicate submissions via ref tracking.",
  "frontend/src/components/SensoryCortexTab.tsx": "Handles file uploads (drag-drop, manual, camera) with chunked processing for large files, routing documents to appropriate agents based on content type and generating previews for text/image files.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance with authentication, initializing access control and invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context with login/logout functionality, identity persistence, and status tracking through React context and AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including debate management (start, abort, clear, status), document routing, and agent registry management (get statuses, toggle, reset).",
  "frontend/src/hooks/useSpeechRecognition.ts": "React hook wrapping the Web Speech Recognition API to provide voice-to-text transcription with start/stop controls, error handling, and browser support detection.",
  "frontend/src/hooks/useSpeechSynthesis.ts": "React hook wrapping the Web Speech Synthesis API to convert text to speech with British male voice preference and speaking state management.",
  "frontend/src/hooks/useWakeWordStub.ts": "Commented-out stub for future Picovoice Porcupine wake word detection integration to trigger speech recognition automatically.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark theme colors using OKLCH color space, including design tokens for UI components.",
  "frontend/src/main.tsx": "React application entry point that sets up QueryClient, InternetIdentityProvider, and renders the root App component.",
  "frontend/src/utils/transcriptParser.ts": "Utility function that sanitizes AI response text by stripping HTML table tags and converting URLs and markdown links to clickable anchor elements.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from query strings or hash-based routing, with sessionStorage persistence for maintaining state like admin tokens across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH, container settings, border radius variables, animations, and typography/container-queries plugins.",
  "frontend/vite.config.ts": "Vite build configuration for React with environment variable injection for canister IDs, path aliases, and local development proxy to IC replica on port 4943.",
  "project_state.json": "Project state tracking document describing the 10-canister multi-agent AI system architecture, cycle management strategy (Option 2: Agents Self-Sustaining), known issues, and pending feature requests including Deep Thought accountant canister implementation."
}