{
  "backend/main.mo": "Main Motoko actor for the backend, defining data types (Agent, DebateState, UserProfile), pre-populating 9 named agents, and exposing query/update methods for debate management, agent toggling, user profiles, and file registration with role-based access control.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "JSON document summarizing each frontend source file's purpose and key implementation details for build planning reference.",
  "frontend/.env": "Local development environment variables setting the backend canister ID and DFX network to local.",
  "frontend/.env.production": "Production environment variables setting the backend canister ID and DFX network to the IC mainnet.",
  "frontend/index.css": "Global CSS defining Tailwind base styles and OKLCH-based CSS custom properties for a neutral grayscale design system with light and dark mode support.",
  "frontend/index.html": "HTML entry point titled 'The Gang' that mounts the React app into a root div and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component implementing a three-tab UI (Boardroom, Sensory Cortex, Swarm Health) with push-to-talk and text command input for starting debates, transcript download, and Internet Identity authentication gating.",
  "frontend/src/components/AgentRegistryTable.tsx": "Agent registry table component displaying system vitals and per-agent status with enable/disable toggles, memory usage bars, diagnostics modal access, and a Reset Agents button.",
  "frontend/src/components/CrashLogModal.tsx": "Modal dialog that displays diagnostic telemetry for a selected agent, showing its ID, online/offline status, and a static log indicating zero traps recorded.",
  "frontend/src/components/DebateDisplay.tsx": "Renders the boardroom debate transcript as a scrollable card, parsing speaker lines and displaying them with color-coded badges, a text-to-speech button per message, and an emergency mode indicator.",
  "frontend/src/components/InterruptButton.tsx": "A destructive button that stops active speech synthesis and calls the backend `abortDebate` mutation to interrupt an ongoing debate.",
  "frontend/src/components/PushToTalkButton.tsx": "A toggle button that starts/stops browser speech recognition and fires a callback with the completed transcript when the user stops talking.",
  "frontend/src/components/SensoryCortexTab.tsx": "A file upload UI that accepts drag-and-drop, manual selection, or camera capture, then sends the file to the backend in chunks via the `routeDocument` mutation, tracking upload progress.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous ICP actor using React Query, reinitializing it when the Internet Identity changes and invalidating dependent queries on actor updates.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an `InternetIdentityProvider` context and `useInternetIdentity` hook that manage DFINITY AuthClient lifecycle, login/logout, and identity state persistence across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Exports React Query hooks for all backend interactions including fetching debate status, starting/aborting/clearing debates, routing documents, and managing agent registry and statuses.",
  "frontend/src/hooks/useSpeechRecognition.ts": "React hook wrapping the Web Speech API SpeechRecognition interface, exposing start/stop controls, transcript state, error handling, and a browser-support flag.",
  "frontend/src/hooks/useSpeechSynthesis.ts": "React hook wrapping the Web Speech Synthesis API with voice loading, British male voice selection, speak/cancel controls, and speaking state tracking.",
  "frontend/src/hooks/useWakeWordStub.ts": "Commented-out stub placeholder for integrating Picovoice Porcupine wake-word detection to automatically trigger speech recognition.",
  "frontend/src/index.css": "Global CSS entry point that imports Tailwind layers and defines OKLCH-based CSS custom properties for light and dark theme design tokens.",
  "frontend/src/main.tsx": "React application entry point that mounts the app with React Query and InternetIdentity providers wrapping the root App component.",
  "frontend/src/utils/transcriptParser.ts": "Utility that sanitizes AI response text by stripping HTML table tags and converting plain URLs and Markdown links into styled anchor elements.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL query parameters from both standard and hash-based routes, with sessionStorage persistence and hash-cleanup helpers.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration mapping OKLCH CSS variables to semantic color tokens, extending theme with border radius, shadows, accordion animations, and enabling typography, container-queries, and animate plugins.",
  "frontend/vite.config.ts": "Vite build configuration for the React frontend with path aliases, environment variable injection for ICP canister IDs, and a dev-server proxy routing /api to the local DFX replica.",
  "project_state.json": "Project state tracker documenting the 10-canister ICP architecture, feature request statuses, known issues, and architectural notes for the multi-agent AI system 'The Gang'."
}