{
  "backend/main.mo": "Main backend orchestrator actor with user profile management, agent registry (Skippy, GLaDOS, Robby), debate state control, file metadata registry, blob storage mixin, and role-based access control using Internet Identity principals.",
  "feature_evidence.json": "Feature evidence report documenting four high-confidence requirements: removing the Sensory Cortex Principal input field, simplifying upload button validation to file-only check, routing chunks to backend Orchestrator's upload_chunk, and calling route_document with 5000-character preview after upload completion.",
  "frontend-file-summaries.txt": "JSON summary of all frontend files describing the tactical dark UI with Internet Identity auth, tabbed navigation (boardroom/sensory/health), agent registry C2 dashboard, file ingestion with chunking, and debate display with speech synthesis.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH-based neutral grayscale color palette for tactical dark aesthetic, supporting both light and dark modes with custom CSS variables for all UI components.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx for 'The Gang' voice assistant application.",
  "frontend/src/App.tsx": "Main React app component with three tabs (boardroom/sensory/health), Internet Identity authentication, push-to-talk debate initiation, emergency mode badge, and conditional rendering of DebateDisplay, SensoryCortexTab, and AgentRegistryTable.",
  "frontend/src/components/AgentRegistryTable.tsx": "Agent registry table displaying all agents with real-time online/offline status indicators (green/red), kill switch toggles using shadcn Switch component, and tactical dark styling with neon green accents.",
  "frontend/src/components/DebateDisplay.tsx": "Displays live debate status with transcript, speaker info, and badges for emergency/locked states. Automatically triggers text-to-speech for Robby's responses when authenticated.",
  "frontend/src/components/InterruptButton.tsx": "Provides a button to interrupt/stop the debate by canceling speech synthesis and calling the backend abort mutation.",
  "frontend/src/components/PushToTalkButton.tsx": "Implements a push-to-talk button using speech recognition that captures user voice input and returns the transcript when recording stops.",
  "frontend/src/components/SensoryCortexTab.tsx": "Handles file upload via drag-and-drop or file input, chunks large files into 1.8MB pieces, extracts previews, and routes documents to the Sensory Cortex agent.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance with authentication, initializing access control with admin token and invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context with login/logout functionality, identity management, and status tracking for the application.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for debate operations (start, abort, status polling), document routing, and agent management with placeholder principals for future canister integration.",
  "frontend/src/hooks/useSpeechRecognition.ts": "Custom hook wrapping the Web Speech Recognition API to capture voice input with start/stop controls and error handling.",
  "frontend/src/hooks/useSpeechSynthesis.ts": "Custom React hook that wraps the browser's Web Speech API for text-to-speech, with support for selecting British male voices and managing speech state (speaking/stopped).",
  "frontend/src/hooks/useWakeWordStub.ts": "Commented-out stub file for future integration of Picovoice Porcupine wake word detection to trigger speech recognition automatically.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark theme colors using OKLCH color space, including design tokens for borders, backgrounds, and chart colors.",
  "frontend/src/main.tsx": "React application entry point that sets up QueryClient, InternetIdentityProvider, and renders the root App component.",
  "frontend/src/utils/transcriptParser.ts": "Utility function that sanitizes transcript text by removing HTML table tags and converting URLs and markdown links into clickable anchor elements.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color tokens using OKLCH color space, container settings, border radius variables, animations, and plugin integrations for typography and container queries.",
  "project_state.json": "Project metadata describing The Gang multi-agent system architecture with 8 AI agent canisters plus 1 ingestion canister on Internet Computer, including known issues with Sensory Cortex UI Principal validation blocking file uploads."
}