{
  "backend/main.mo": "Main Motoko actor implementing a multi-agent debate system with access control, blob storage mixins, user profiles, agent registry with 9 pre-populated agents (Skippy, GLaDOS, Robby, etc.), debate state management, file metadata registry, and authorization-protected endpoints for debate control and agent status toggling.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features documented.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend TypeScript/React components, hooks, and configuration files describing the debate UI, speech recognition/synthesis, agent management, file upload, and authentication features.",
  "frontend/.env": "Development environment configuration specifying local backend canister ID (bkyz2-fmaaa-aaaaa-qaaaq-cai) and DFX network set to local.",
  "frontend/.env.production": "Production environment configuration with the same canister ID and DFX network set to 'ic' for Internet Computer mainnet deployment.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color palette defining CSS variables for light and dark mode themes using neutral grayscale values for a technical backend aesthetic.",
  "frontend/index.html": "Minimal HTML entry point with root div and module script loading main.tsx for the React application titled 'The Gang'.",
  "frontend/src/App.tsx": "Main React application component with tab navigation (boardroom, sensory, health), authentication guards, debate management UI including push-to-talk, interrupt, download transcript, and clear boardroom actions, with all hooks called before conditional returns.",
  "frontend/src/components/AgentRegistryTable.tsx": "Agent status table component with kill switch toggles using proper error handling in try/catch/finally blocks, tactical dark green/red styling, loading states, and backend connection guards.",
  "frontend/src/components/DebateDisplay.tsx": "Debate transcript display component with speaker-specific color coding, text-to-speech playback for Robby's responses, emergency mode badge, and fixed minimum height to prevent layout shifts.",
  "frontend/src/components/InterruptButton.tsx": "A button component that stops speech synthesis and aborts the ongoing debate by calling the backend abort mutation.",
  "frontend/src/components/PushToTalkButton.tsx": "A button component that toggles speech recognition on/off and calls a callback with the final transcript when recording stops, with duplicate prevention logic.",
  "frontend/src/components/SensoryCortexTab.tsx": "A file upload component supporting drag-and-drop, camera capture, and manual selection that chunks large files (1.8MB chunks) and routes documents to backend agents with progress tracking.",
  "frontend/src/hooks/useActor.ts": "A React Query hook that creates and manages the backend actor instance with Internet Identity authentication, initializing access control and invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "A React context provider and hook for Internet Identity authentication, managing login/logout state and identity persistence with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for debate operations (start, abort, clear), document routing, agent status management, and polling debate/agent state with reduced refetch intervals to prevent infinite loops.",
  "frontend/src/hooks/useSpeechRecognition.ts": "A hook wrapping the Web Speech Recognition API with start/stop controls, transcript state management, and functional updates to prevent stale closure issues.",
  "frontend/src/hooks/useSpeechSynthesis.ts": "A hook wrapping the Web Speech Synthesis API with voice selection (preferring British male voices), speak/cancel controls, and speaking state tracking.",
  "frontend/src/hooks/useWakeWordStub.ts": "A commented-out stub for future integration of Picovoice Porcupine wake word detection to trigger speech recognition automatically.",
  "frontend/src/index.css": "Tailwind CSS configuration file defining CSS custom properties for light and dark themes, including colors for UI components (primary, secondary, destructive, charts, etc.) and base styles for body and code elements.",
  "frontend/src/main.tsx": "React application entry point that sets up the root component with QueryClient for data fetching and InternetIdentityProvider for authentication, then renders the App component.",
  "frontend/src/utils/transcriptParser.ts": "Utility function that sanitizes transcript text by removing HTML table tags and converting URLs and markdown-style links into clickable anchor elements with styling.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme extensions including OKLCH color system, container settings, border radius variables, custom shadows, and accordion animations, with typography and container query plugins.",
  "frontend/vite.config.ts": "Vite build configuration for React app with environment variable injection for canister IDs, path aliases, and local development proxy to route /api requests to the local DFX network on port 4943.",
  "project_state.json": "Project state tracking file indicating a fix request to regenerate backend Candid interface declarations and synchronize frontend declarations to resolve 'Actor missing' errors after adding the clearBoardroom method."
}