{
  "backend/main.mo": "Main backend actor implementing debate orchestration, user profiles, agent registry with pre-populated agents (Skippy, GLaDOS, Robby, etc.), file metadata storage, and access control using mixins for authorization and blob storage.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components, hooks, and configuration files describing the React application structure with speech recognition, debate display, agent management, and file upload capabilities.",
  "frontend/.env": "Local development environment configuration specifying backend canister ID (bkyz2-fmaaa-aaaaa-qaaaq-cai) and local DFX network.",
  "frontend/.env.production": "Production environment configuration with the same canister ID and IC mainnet network setting.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color palette defining neutral grayscale design tokens for light and dark modes, including sidebar, chart, and destructive color variables.",
  "frontend/index.html": "HTML entry point for the application titled 'The Gang' with a root div and module script loading main.tsx.",
  "frontend/src/App.tsx": "Main React application component with three tabs (Boardroom, Sensory Cortex, Swarm Health), authentication handling, debate controls including push-to-talk and text command input, and transcript download functionality.",
  "frontend/src/components/AgentRegistryTable.tsx": "Agent registry table displaying system infrastructure vitals, agent status with toggle switches, memory usage progress bars, cycle counts, and diagnostic log modal integration.",
  "frontend/src/components/CrashLogModal.tsx": "Modal dialog component displaying agent diagnostics with monospace terminal-style UI showing telemetry status and system messages in green-on-black theme.",
  "frontend/src/components/DebateDisplay.tsx": "Displays a debate transcript with speaker badges (Skippy, GLaDOS, Robby, SYSTEM), auto-scrolling, and text-to-speech functionality. Shows emergency mode indicator and parses transcript lines by speaker.",
  "frontend/src/components/InterruptButton.tsx": "Provides a button to interrupt/stop an active debate by canceling speech synthesis and calling the backend abort mutation.",
  "frontend/src/components/PushToTalkButton.tsx": "Implements a push-to-talk button using speech recognition that starts/stops listening and calls onTranscriptComplete callback when speech recognition stops with new transcript.",
  "frontend/src/components/SensoryCortexTab.tsx": "Handles file uploads (drag-drop, manual, camera) with chunked processing for large files, routes documents to agents, and displays upload progress with text/image preview generation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous actor instance based on Internet Identity, initializing access control and invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context with login/logout functionality, identity management, and status tracking using AuthClient with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for debate operations (start, abort, clear, status polling), agent management (get statuses, toggle), and document routing with placeholder implementations.",
  "frontend/src/hooks/useSpeechRecognition.ts": "Wraps Web Speech Recognition API with React hooks, providing start/stop controls, transcript state, error handling, and browser support detection using functional state updates to prevent stale closures.",
  "frontend/src/hooks/useSpeechSynthesis.ts": "React hook that wraps the Web Speech API for text-to-speech, providing speak/cancel functions, voice selection (with British male voice preference), and speaking state tracking.",
  "frontend/src/hooks/useWakeWordStub.ts": "Commented-out stub for future wake word detection integration using Picovoice Porcupine library to trigger speech recognition automatically.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark theme colors using OKLCH color space, plus base typography and code font styling.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/utils/transcriptParser.ts": "Utility function that sanitizes transcript text by removing HTML table tags and converting URLs and markdown links into clickable anchor elements.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and managing URL parameters from both query strings and hash-based routing, with sessionStorage integration for parameter persistence.",
  "frontend/tailwind.config.js": "Tailwind configuration defining custom color tokens using OKLCH, container settings, border radius variables, animations, and plugins for typography, container queries, and animations.",
  "frontend/vite.config.ts": "Vite build configuration with React plugin, environment variable injection for canister IDs, path aliases, and local development proxy for API calls to dfx replica.",
  "project_state.json": "Project metadata documenting the single-user Internet Identity-secured architecture, removal of all backend auth checks, locked Golden Master backend (v56), multi-canister telemetry setup, and existing features list."
}