{
  "backend/main.mo": "Main backend actor with state migration, blob storage, access control, user profiles, debate state management, agent registry (9 agents with enable/disable toggles), file metadata tracking, and integration with SensoryCortex actor.",
  "backend/migration.mo": "Migration module that transforms old actor state to new actor state by adding agents map, nextAgentId counter, and userProfiles map while preserving existing fileRegistry and currentState.",
  "feature_evidence.json": "Feature evidence report documenting implementation of agent registry table UI with toggle switches, status indicators (green/red), and React Query hooks for agent status management in the Swarm Health tab.",
  "frontend-file-summaries.txt": "JSON summary of all frontend files describing the main App with tabbed navigation, agent registry table with kill switches, debate display, push-to-talk functionality, file ingestion, and authentication features.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color palette defining neutral grayscale design tokens for light and dark modes suitable for tactical/technical UI aesthetic.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx for 'The Gang' voice assistant application.",
  "frontend/src/App.tsx": "Main React component with three tabs (boardroom, sensory, health), Internet Identity authentication, debate controls, push-to-talk interface, and AgentRegistryTable rendering in the health tab with tactical dark theme.",
  "frontend/src/components/AgentRegistryTable.tsx": "Agent registry table component displaying 9 AI agents with real-time status indicators (green online/red offline), kill switch toggles using shadcn Switch, and toast notifications for toggle actions.",
  "frontend/src/components/DebateDisplay.tsx": "Displays live debate status with transcript, speaker info, and badges for emergency/locked states. Automatically triggers text-to-speech for Robby's responses when authenticated.",
  "frontend/src/components/InterruptButton.tsx": "Provides a button to interrupt/stop the debate by canceling speech synthesis and calling the backend abort mutation.",
  "frontend/src/components/PushToTalkButton.tsx": "Implements push-to-talk functionality using speech recognition, with visual feedback during listening and callback on transcript completion.",
  "frontend/src/components/SensoryCortexTab.tsx": "Handles file upload to Sensory Cortex with drag-and-drop support, chunking large files into 1.8MB pieces, extracting previews, and routing documents to agents.",
  "frontend/src/hooks/useActor.ts": "Manages actor creation with Internet Identity authentication, initializes access control with admin token, and invalidates dependent queries on actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and AuthClient configuration.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for debate operations (status polling, start, abort), document routing, and agent status management with static agent list.",
  "frontend/src/hooks/useSpeechRecognition.ts": "Custom hook wrapping Web Speech API for speech-to-text, handling browser compatibility, recognition lifecycle, and transcript extraction.",
  "frontend/src/hooks/useSpeechSynthesis.ts": "React hook that wraps the browser's Web Speech API for text-to-speech synthesis, with support for selecting British male voices and managing speech state (speaking/stopped).",
  "frontend/src/hooks/useWakeWordStub.ts": "Commented-out stub for future integration of Picovoice Porcupine wake word detection to trigger speech recognition automatically.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark theme colors using OKLCH color space, including design tokens for UI components and charts.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient provider for React Query and InternetIdentityProvider for IC authentication.",
  "frontend/src/utils/transcriptParser.ts": "Utility function that sanitizes transcript text by removing HTML table tags and converting URLs and markdown links into clickable anchor elements.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage integration for parameter persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH, container settings, border radius variables, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing The Gang multi-agent system architecture with 8 AI agent canisters plus 1 ingestion canister on Internet Computer, including sovereignty constraints, storage limits, inter-canister communication patterns, and implemented features for real-time debate UI with speech recognition."
}