{
  "backend/main.mo": "Main backend actor implementing user profiles, debate state management, agent registry with pre-populated agents (Skippy, GLaDOS, Robby, etc.), file metadata storage, and access control integration with authorization mixins.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, hooks, configuration, and utilities for the debate/agent management application.",
  "frontend/.env": "Local development environment configuration with backend canister ID and DFX network set to local.",
  "frontend/.env.production": "Production environment configuration with backend canister ID and DFX network set to IC mainnet.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color palette for light and dark modes using neutral grayscale values for technical infrastructure theming.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx for 'The Gang' application.",
  "frontend/src/App.tsx": "Main application component with three tabs (Boardroom, Sensory Cortex, Swarm Health), authentication handling, debate controls including push-to-talk, text commands, transcript download, and interrupt functionality.",
  "frontend/src/components/AgentRegistryTable.tsx": "Agent registry table displaying system vitals, agent status with toggle switches, memory usage progress bars, diagnostics modal, and reset agents button with toast notifications.",
  "frontend/src/components/CrashLogModal.tsx": "Dialog modal component displaying agent diagnostics and telemetry information with monospace terminal-style formatting in green/black theme.",
  "frontend/src/components/DebateDisplay.tsx": "Displays a scrollable transcript of debate messages between AI agents (Skippy, GLaDOS, Robby) with color-coded badges, text-to-speech playback controls, and an emergency mode indicator.",
  "frontend/src/components/InterruptButton.tsx": "Provides a button to interrupt/stop an active debate by canceling speech synthesis and calling the backend abort mutation.",
  "frontend/src/components/PushToTalkButton.tsx": "Implements a push-to-talk button using speech recognition that starts/stops listening and invokes a callback with the transcript when recording completes.",
  "frontend/src/components/SensoryCortexTab.tsx": "Handles file uploads (drag-drop, manual, camera) by chunking large files and routing them to appropriate agents via backend, displaying upload progress and routing results.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance with authentication, initializing access control and invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including debate status polling, starting/aborting debates, document routing, and agent management with automatic cache invalidation.",
  "frontend/src/hooks/useSpeechRecognition.ts": "Custom React hook that wraps the Web Speech Recognition API to provide voice-to-text transcription with start/stop controls, error handling, and browser support detection.",
  "frontend/src/hooks/useSpeechSynthesis.ts": "Custom React hook that wraps the Web Speech Synthesis API to convert text to speech, with support for British male voice selection and speaking state management.",
  "frontend/src/hooks/useWakeWordStub.ts": "Commented-out stub for future integration of Picovoice Porcupine wake word detection to trigger speech recognition automatically.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark theme colors using OKLCH color space, plus base typography and code font styles.",
  "frontend/src/main.tsx": "React application entry point that sets up QueryClient, InternetIdentityProvider, and renders the root App component.",
  "frontend/src/utils/transcriptParser.ts": "Utility function that sanitizes transcript text by removing HTML table tags and converting URLs and markdown links into clickable anchor elements.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and managing URL parameters from both query strings and hash-based routing, with sessionStorage integration for parameter persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color tokens using OKLCH, container settings, border radius variables, animations, and plugin integrations for typography and container queries.",
  "frontend/vite.config.ts": "Vite build configuration with React plugin, environment variable injection for canister IDs, path aliases, and local development proxy for API calls to dfx.",
  "project_state.json": "Project metadata documenting the single-user Internet Identity architecture, removal of all backend permission checks, locked backend canisters, multi-canister telemetry setup, and existing features with requirement IDs."
}