{
  "backend/main.mo": "Main backend actor implementing debate orchestration, agent registry with pre-populated agents (Skippy, GLaDOS, Robby, etc.), user profile management, file metadata storage, and access control with admin/user permissions.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features documented.",
  "frontend-file-summaries.txt": "JSON-formatted documentation of frontend component summaries describing debate UI, speech recognition, agent registry, file upload, and authentication features with implementation details.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH-based neutral grayscale color palette supporting light and dark modes for a technical backend infrastructure aesthetic.",
  "frontend/index.html": "HTML entry point for the React application titled 'The Gang' with root div and module script reference.",
  "frontend/src/App.tsx": "Main application component with tabbed interface (boardroom/sensory/health), Internet Identity authentication, debate orchestration with four-state conditional rendering, and comprehensive error handling with loading guards for backend actor availability.",
  "frontend/src/components/AgentRegistryTable.tsx": "Agent registry table displaying agent statuses with real-time indicators, kill switch toggles using shadcn Switch component, tactical dark aesthetic, and backend actor initialization guard clauses.",
  "frontend/src/components/DebateDisplay.tsx": "Debate transcript display component with speaker-specific styling, emergency mode badge, and text-to-speech functionality for Robby's responses.",
  "frontend/src/components/InterruptButton.tsx": "Interrupt button component that cancels active speech synthesis and calls backend abort_debate function to stop debates immediately.",
  "frontend/src/components/PushToTalkButton.tsx": "A React component that provides a push-to-talk button for speech recognition, displaying mic icons and listening state, and calling onTranscriptComplete when speech recognition stops with a transcript.",
  "frontend/src/components/SensoryCortexTab.tsx": "A file upload component supporting drag-and-drop, camera capture, and chunked uploads (1.8MB chunks) that routes documents to backend agents, extracting text previews for text files and handling binary data for images.",
  "frontend/src/hooks/useActor.ts": "A React Query hook that creates and manages an authenticated or anonymous backend actor based on Internet Identity, initializing access control with an admin token and invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options for idle handling and derivation origin.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for backend operations including debate status polling, starting/aborting debates, routing documents, and managing agent statuses with automatic query invalidation on mutations.",
  "frontend/src/hooks/useSpeechRecognition.ts": "A custom React hook that wraps the Web Speech Recognition API, managing listening state, transcript capture, and error handling with support for starting/stopping recognition and clearing transcripts between sessions.",
  "frontend/src/hooks/useSpeechSynthesis.ts": "A custom React hook for text-to-speech using the Web Speech Synthesis API, with voice selection logic prioritizing British male voices and providing speak/cancel controls with speaking state tracking.",
  "frontend/src/hooks/useWakeWordStub.ts": "A commented-out stub for future integration of Picovoice Porcupine wake word detection that would trigger speech recognition automatically when a wake word is detected.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a design system for light and dark themes, including colors for backgrounds, foregrounds, borders, and chart elements using oklch color space.",
  "frontend/src/main.tsx": "React application entry point that sets up the root with QueryClient for data fetching and InternetIdentityProvider for authentication, then renders the App component.",
  "frontend/src/utils/transcriptParser.ts": "Utility function that sanitizes transcript text by stripping HTML table tags and converting URLs and markdown-style links into clickable anchor tags with styling.",
  "frontend/src/utils/urlParams.ts": "Comprehensive URL parameter management utilities supporting both regular query strings and hash-based routing, with sessionStorage persistence for parameters like admin tokens across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extending colors using OKLCH color space, custom animations for accordions, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing a multi-canister AI agent system called 'The Gang' with 8 AI agents plus 1 ingestion canister, including architectural notes about sovereignty, storage limits, and known issues with React state updates and backend debate functions."
}