{
  "backend/main.mo": "Main Motoko actor implementing a multi-agent debate system with user profiles, agent registry (9 pre-populated agents with different types), file metadata storage, debate state management, and mixins for blob storage and authorization.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features documented.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend TypeScript/React components, hooks, and configuration files describing the voice-enabled debate UI, authentication, file upload, and agent management features.",
  "frontend/.env": "Local development environment variables defining the backend canister ID and DFX network setting.",
  "frontend/.env.production": "Production environment variables with the same canister ID but targeting the IC network instead of local.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color palette defining CSS variables for light and dark mode themes using neutral grayscale values.",
  "frontend/index.html": "Minimal HTML entry point with root div and module script tag loading the React application titled 'The Gang'.",
  "frontend/src/App.tsx": "Main React application component with tab navigation (boardroom, sensory, health), authentication guards, debate state management, push-to-talk integration, and emergency mode alerts with all hooks called before conditional returns.",
  "frontend/src/components/AgentRegistryTable.tsx": "Agent registry table component displaying agent status with kill switch toggles, loading states, error handling with finally blocks to prevent stuck UI, and tactical dark aesthetic with neon green accents.",
  "frontend/src/components/DebateDisplay.tsx": "Debate transcript display component with speaker-specific color coding, text-to-speech button for Robby's responses, emergency mode badge, and fixed minimum height to prevent layout shifts.",
  "frontend/src/components/InterruptButton.tsx": "A destructive button component that stops speech synthesis and aborts the debate by calling the backend mutation when clicked.",
  "frontend/src/components/PushToTalkButton.tsx": "A microphone button that toggles speech recognition on/off and calls onTranscriptComplete with the final transcript when recording stops, with deduplication logic to prevent reprocessing.",
  "frontend/src/components/SensoryCortexTab.tsx": "A file upload component supporting drag-and-drop, camera capture, and manual selection that chunks large files (1.8MB chunks) and routes documents to backend agents with progress tracking.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance with authentication, initializing access control with an admin token and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context with login/logout functionality, identity management, and configurable AuthClient options for the application.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for debate operations (start, abort, status polling), document routing, and agent registry management with automatic cache invalidation.",
  "frontend/src/hooks/useSpeechRecognition.ts": "Wraps the Web Speech Recognition API to provide start/stop controls, transcript state, and error handling with functional updates to prevent stale closure issues.",
  "frontend/src/hooks/useSpeechSynthesis.ts": "Wraps the Web Speech Synthesis API to speak text with optional British male voice selection and provides cancel functionality with speaking state tracking.",
  "frontend/src/hooks/useWakeWordStub.ts": "A commented-out stub for future wake word detection integration using Picovoice Porcupine to trigger speech recognition automatically.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components (primary, secondary, destructive, muted, accent, charts) and base styles for body and code elements.",
  "frontend/src/main.tsx": "React application entry point that sets up the root component with QueryClientProvider for data fetching and InternetIdentityProvider for authentication, rendering the App component.",
  "frontend/src/utils/transcriptParser.ts": "Utility function that sanitizes transcript text by removing HTML table tags and converting URLs and markdown-style links into clickable anchor tags with styling.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme extensions including OKLCH color system, container settings, border radius variables, custom shadows, and accordion animations, with typography and container query plugins.",
  "frontend/vite.config.ts": "Vite build configuration for React with environment variable injection for canister IDs, path aliases, and local development proxy setup for API requests to port 4943.",
  "project_state.json": "Project state tracking document identifying two critical backend issues: Map persistence bug in toggleAgentStatus requiring change from .add() to .put() method, and AccessControl traps blocking UI execution that need removal from all backend functions."
}