{
  "backend/main.mo": "Main backend actor implementing user profiles, agent registry with pre-populated agents (Skippy, GLaDOS, Robby, etc.), debate state management, file metadata storage, and access control using mixins for authorization and blob storage.",
  "feature_evidence.json": "Feature evidence report documenting two implemented features: Enter-key submission in the Boardroom textarea (REQ-4) and auto-scroll in the DebateDisplay component (REQ-5), both with high confidence.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including App.tsx with three-tab layout, hooks for queries/speech recognition/synthesis, components for debate display/agent registry/sensory cortex, and configuration files.",
  "frontend/.env": "Local development environment variables defining backend canister ID (bkyz2-fmaaa-aaaaa-qaaaq-cai) and DFX network set to local.",
  "frontend/.env.production": "Production environment variables with the same backend canister ID and DFX network set to 'ic' for Internet Computer mainnet.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color palette defining neutral grayscale design tokens for light and dark modes, including sidebar, chart, and destructive color variables.",
  "frontend/index.html": "HTML entry point with title 'The Gang' and a root div that loads the React application via main.tsx module script.",
  "frontend/src/App.tsx": "Main React component with three tabs (Boardroom, Sensory Cortex, Swarm Health), Internet Identity authentication, and BoardroomTab featuring a text command console with Enter-key submission, push-to-talk, interrupt button, and debate display with download/clear functionality.",
  "frontend/src/components/AgentRegistryTable.tsx": "Agent registry table component displaying agent status with kill switch toggles, tactical dark aesthetic with neon green accents, comprehensive error handling in toggle operations, and loading states for backend initialization.",
  "frontend/src/components/DebateDisplay.tsx": "Displays the debate transcript with color-coded speaker badges (Skippy, GLaDOS, Robby, SYSTEM), auto-scrolling, and text-to-speech playback buttons for each message. Shows emergency mode indicator when active.",
  "frontend/src/components/InterruptButton.tsx": "Provides a button to interrupt/stop an active debate by canceling speech synthesis and calling the backend abort mutation.",
  "frontend/src/components/PushToTalkButton.tsx": "Implements push-to-talk voice input using speech recognition, with visual feedback during listening and automatic transcript submission when recording stops.",
  "frontend/src/components/SensoryCortexTab.tsx": "Handles file uploads (drag-and-drop, manual, camera) by chunking large files into 1.8MB pieces, generating previews for text/images, and routing documents to appropriate agents via backend mutation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance with Internet Identity authentication, initializing access control with admin token and invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login/logout state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including debate status polling, starting/aborting debates, clearing boardroom, routing documents, and managing agent statuses with automatic cache invalidation.",
  "frontend/src/hooks/useSpeechRecognition.ts": "React hook that wraps the browser's Web Speech API for speech recognition, providing start/stop controls, transcript state, error handling, and browser support detection with functional state updates to prevent stale closures.",
  "frontend/src/hooks/useSpeechSynthesis.ts": "React hook for text-to-speech using the browser's SpeechSynthesis API, with voice selection logic prioritizing British male voices and providing speak/cancel controls with speaking state tracking.",
  "frontend/src/hooks/useWakeWordStub.ts": "Commented-out stub for future Picovoice Porcupine wake word detection integration that would trigger speech recognition automatically when a wake word is detected.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes using OKLCH color space, defining design tokens for colors, borders, and component styling.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider context wrappers before rendering the main App component.",
  "frontend/src/utils/transcriptParser.ts": "Utility function that sanitizes transcript text by removing HTML table tags and converting URLs and markdown-style links into clickable anchor elements with styling.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence for parameters like admin tokens.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme extensions with OKLCH color system, container settings, animations, and plugins for typography, container queries, and animations.",
  "frontend/vite.config.ts": "Vite build configuration for React with environment variable injection for canister IDs, path aliases, and local development proxy setup for API calls to port 4943.",
  "project_state.json": "Project metadata tracking architectural decisions, known issues, and feature requests for a single-user Internet Identity-secured application with backend permission checks removed and version 56 backend marked as immutable 'Golden Master'."
}