{
  "backend/main.mo": "Main Motoko actor implementing a multi-agent debate system with user profiles, agent registry (9 pre-populated agents with different types), debate state management, file storage integration, and role-based access control using authorization and blob-storage mixins.",
  "feature_evidence.json": "Feature evidence report documenting three requirements: removing loading guards from main App.tsx layout, implementing strict early return patterns in Boardroom component, and implementing strict early return patterns in SwarmHealth component with specific conditional rendering order.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of frontend files describing implementation details including strict early return patterns, speech recognition/synthesis hooks, reduced polling intervals, error handling, and tactical dark UI components.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH-based neutral grayscale color palette supporting light and dark modes, defining CSS custom properties for UI components including sidebar, charts, and form elements.",
  "frontend/index.html": "HTML entry point for 'The Gang' application with root div and module script loading main.tsx.",
  "frontend/src/App.tsx": "Main React application component with Header/Navbar always rendered, BoardroomTab implementing strict early return pattern (isLoading, !isAuthenticated, !actor checks), debate controls with push-to-talk and interrupt functionality, emergency mode alerts, and tab navigation for boardroom/sensory/health views.",
  "frontend/src/components/AgentRegistryTable.tsx": "Agent registry table component with tactical dark aesthetic displaying agent status indicators, kill switch toggles using proper arrow function handlers with comprehensive try/catch/finally error handling, and loading/error states for backend actor initialization.",
  "frontend/src/components/DebateDisplay.tsx": "Displays a debate transcript with color-coded messages from different speakers (Skippy, GLaDOS, Robby, SYSTEM, User), showing emergency mode badge and debate status, with text-to-speech playback for Robby's messages when authenticated.",
  "frontend/src/components/InterruptButton.tsx": "Provides a button to interrupt/stop an ongoing debate by canceling speech synthesis and calling the backend's abortDebate mutation.",
  "frontend/src/components/PushToTalkButton.tsx": "Implements a push-to-talk button using speech recognition that starts/stops listening on click and calls onTranscriptComplete callback with the recognized text when recording stops.",
  "frontend/src/components/SensoryCortexTab.tsx": "Handles file uploads (drag-and-drop, manual, camera) by chunking files into 1.8MB pieces, generating previews for text/images, and routing documents to appropriate agents via the backend.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance with authentication, initializing access control with admin token and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout, managing identity state and delegation validity with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for debate operations (start, abort, status polling), document routing, and agent status management with automatic cache invalidation.",
  "frontend/src/hooks/useSpeechRecognition.ts": "Wraps the Web Speech Recognition API to provide start/stop listening controls, transcript state, and error handling with automatic cleanup.",
  "frontend/src/hooks/useSpeechSynthesis.ts": "React hook that wraps the Web Speech API for text-to-speech, providing speak/cancel functions with optional British male voice selection and tracking speaking state.",
  "frontend/src/hooks/useWakeWordStub.ts": "Commented-out stub for future Picovoice Porcupine wake word detection integration that would trigger speech recognition automatically.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark theme colors using OKLCH color space, including design tokens for UI components and charts.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/utils/transcriptParser.ts": "Utility function that sanitizes transcript text by stripping HTML table tags and converting URLs and markdown links to clickable anchor elements.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both query strings and hash-based routing, with sessionStorage persistence and cleanup capabilities for sensitive parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration defining custom color system using OKLCH variables, container settings, border radius tokens, animations, and plugins for typography and container queries.",
  "project_state.json": "Project metadata documenting The Gang multi-agent system architecture with 9 canisters, known React rendering issues, existing features, and architectural constraints including 390GB storage cap and 1.8MB chunk limits."
}