{
  "backend/main.mo": "Main backend actor that includes blob storage and authorization mixins, manages user profiles, agent registry with pre-populated core agents (Skippy, GLaDOS, Robby, etc.), debate state tracking, and file metadata registry with access control enforced on all public endpoints.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend source files including components, hooks, utilities, and configuration files with implementation details and architectural patterns.",
  "frontend/.env": "Development environment configuration file specifying local backend canister ID (bkyz2-fmaaa-aaaaa-qaaaq-cai) and DFX network set to local.",
  "frontend/.env.production": "Production environment configuration file with the same canister ID as development and DFX network set to 'ic' for Internet Computer mainnet.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color palette defining CSS variables for light and dark modes with neutral grayscale theme suitable for technical infrastructure projects.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx, titled 'The Gang'.",
  "frontend/src/App.tsx": "Main application component with tab navigation (boardroom, sensory, health), BoardroomTab featuring push-to-talk, interrupt, session management with download/clear transcript, emergency mode alerts, and strict authentication guards with all hooks called before conditional returns.",
  "frontend/src/components/AgentRegistryTable.tsx": "Agent registry table component with tactical dark aesthetic displaying agent status indicators and kill switch toggles using proper error handling with try/catch/finally blocks that always reset loading state, preventing stuck UI.",
  "frontend/src/components/DebateDisplay.tsx": "Real-time debate transcript display with speaker-specific color coding, emergency mode badge, text-to-speech playback for Robby's responses, and fixed min-height to prevent layout shifts.",
  "frontend/src/components/InterruptButton.tsx": "A button component that stops speech synthesis and aborts the debate by calling the backend mutation. Shows loading state while aborting.",
  "frontend/src/components/PushToTalkButton.tsx": "A push-to-talk button that uses speech recognition to capture user voice input and calls onTranscriptComplete when recording stops. Includes browser compatibility check and visual feedback during recording.",
  "frontend/src/components/SensoryCortexTab.tsx": "A file upload component supporting drag-and-drop, camera capture, and manual file selection. Processes files in 1.8MB chunks and routes them to backend agents with progress tracking.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance with authentication, initializing access control with admin token. Invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context with login/logout functionality and identity state management. Creates AuthClient with configurable options and handles identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for debate operations (start, abort, clear), agent status management, and document routing. Includes polling queries for debate status and agent registry with cache invalidation.",
  "frontend/src/hooks/useSpeechRecognition.ts": "Wraps browser SpeechRecognition API to provide voice input functionality with start/stop controls. Uses functional state updates to prevent stale closure issues and handles errors gracefully.",
  "frontend/src/hooks/useSpeechSynthesis.ts": "Wraps browser SpeechSynthesis API for text-to-speech with British male voice preference. Provides speak and cancel functions with speaking state tracking.",
  "frontend/src/hooks/useWakeWordStub.ts": "A commented-out stub for future wake word detection using Picovoice Porcupine. Intended to trigger speech recognition automatically on wake word detection.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components (background, foreground, primary, secondary, etc.) and applying base styles to body and code elements.",
  "frontend/src/main.tsx": "React application entry point that sets up the root component with QueryClientProvider for data fetching and InternetIdentityProvider for authentication.",
  "frontend/src/utils/transcriptParser.ts": "Utility function that sanitizes transcript text by removing HTML table tags and converting URLs and markdown-style links into clickable anchor elements with styling.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme extensions including OKLCH color system, container settings, border radius variables, custom shadows, and accordion animations with typography and container query plugins.",
  "frontend/vite.config.ts": "Vite build configuration for React with environment variable injection for canister IDs, path aliases, and proxy setup for local API calls to port 4943.",
  "project_state.json": "Project state document describing a single-user Internet Identity-secured application with pending feature requests to remove all Runtime.trap calls, permission checks, and authorization imports from backend/main.mo."
}