{
  "backend/main.mo": "Main backend actor implementing user profiles, agent registry with pre-populated agents (Skippy, GLaDOS, Robby, etc.), debate state management, file metadata storage, and access control integration with authorization mixins.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, hooks, configuration, and utilities for a debate/agent management application with speech recognition and Internet Identity authentication.",
  "frontend/.env": "Local development environment configuration specifying backend canister ID and DFX network set to 'local'.",
  "frontend/.env.production": "Production environment configuration with backend canister ID and DFX network set to 'ic'.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color palette defining CSS variables for light and dark themes with neutral grayscale colors and chart colors.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx for 'The Gang' application.",
  "frontend/src/App.tsx": "Main application component with three tabs (Boardroom, Sensory Cortex, Swarm Health), Internet Identity authentication, debate management with voice/text input, transcript download, and agent registry display.",
  "frontend/src/components/AgentRegistryTable.tsx": "Agent registry table displaying system infrastructure vitals with toggle switches for agent status, memory usage progress bars, diagnostics modal, and reset agents button.",
  "frontend/src/components/CrashLogModal.tsx": "Dialog modal component displaying agent diagnostics and telemetry information with monospace styling and green terminal aesthetic.",
  "frontend/src/components/DebateDisplay.tsx": "Displays a scrollable transcript of debate messages with speaker badges (Skippy, GLaDOS, Robby, SYSTEM), text-to-speech controls for each message, and an emergency mode indicator. Auto-scrolls to the latest message when the transcript updates.",
  "frontend/src/components/InterruptButton.tsx": "Provides a button to interrupt/stop an active debate by canceling speech synthesis and calling the backend abort mutation. Shows loading state while the abort request is pending.",
  "frontend/src/components/PushToTalkButton.tsx": "Implements a push-to-talk button using speech recognition that starts/stops listening on click and calls onTranscriptComplete callback when speech recognition stops with new transcript. Includes browser compatibility check and error display.",
  "frontend/src/components/SensoryCortexTab.tsx": "Handles file uploads (drag-drop, manual, camera) by chunking large files and routing them to appropriate agents via backend. Displays upload progress, routing results, and supports both text and image file types with preview generation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance with authentication, initializing it with Internet Identity when authenticated or as anonymous otherwise. Invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle. Exports useInternetIdentity hook and InternetIdentityProvider component for authentication flow.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including debate status polling, starting/aborting debates, clearing boardroom, routing documents, and managing agent statuses. Each mutation automatically invalidates relevant queries on success.",
  "frontend/src/hooks/useSpeechRecognition.ts": "React hook that wraps the Web Speech Recognition API to provide voice-to-text transcription with start/stop controls, error handling, and browser support detection.",
  "frontend/src/hooks/useSpeechSynthesis.ts": "React hook that wraps the Web Speech Synthesis API to provide text-to-speech functionality with voice selection (preferring British male voices) and speaking state management.",
  "frontend/src/hooks/useWakeWordStub.ts": "Commented-out stub for future Picovoice Porcupine wake word detection integration that would trigger speech recognition automatically.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark theme colors using OKLCH color space, plus base typography and code font styling.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/src/utils/transcriptParser.ts": "Utility function that sanitizes HTML table tags from text and converts URLs and markdown links into clickable anchor elements with styling.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both query strings and hash-based routing, with sessionStorage persistence and cleanup capabilities.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color tokens using OKLCH, container settings, border radius variables, animations, and plugin integrations for typography and container queries.",
  "frontend/vite.config.ts": "Vite build configuration with React plugin, path aliases, environment variable injection for canister IDs, and local development proxy for API requests.",
  "project_state.json": "Project metadata tracking architectural notes, known issues, and a pending feature request (AR-1) to add telemetry actor initialization in useActor.ts hook."
}