{
  "backend/main.mo": "Main backend actor implementing user profiles, debate state management, agent registry with pre-populated core agents (Skippy, GLaDOS, Robby, etc.), file metadata storage, and boardroom debate orchestration with mixins for blob storage and authorization.",
  "feature_evidence.json": "Feature evidence report documenting implementation of useClearBoardroom mutation hook, Download/Trash2 icons, handleDownloadTranscript function, 3-column grid layout, and Session Management card with high confidence test mappings.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including App.tsx with BoardroomTab and SwarmHealthTab, custom hooks for speech recognition/synthesis, transcript parsing utilities, and component implementations with strict early return patterns and error handling.",
  "frontend/.env": "Development environment configuration with local backend canister ID (bkyz2-fmaaa-aaaaa-qaaaq-cai) and DFX_NETWORK set to local.",
  "frontend/.env.production": "Production environment configuration with production backend canister ID and DFX_NETWORK set to ic (Internet Computer mainnet).",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH-based neutral grayscale color palette for light and dark modes, supporting tactical dark aesthetic for technical backend infrastructure project.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx for 'The Gang' application.",
  "frontend/src/App.tsx": "Main application component with BoardroomTab featuring push-to-talk, interrupt, and session management (download/clear transcript) in 3-column grid, plus SensoryCortexTab and AgentRegistryTable with strict hook ordering before conditional returns.",
  "frontend/src/components/AgentRegistryTable.tsx": "Agent registry table with kill switch toggles using arrow functions in onCheckedChange handlers, comprehensive try/catch/finally error handling that always resets updatingId state, and tactical dark aesthetic with real-time status indicators.",
  "frontend/src/components/DebateDisplay.tsx": "Displays debate transcript with color-coded speaker messages (Skippy, GLaDOS, Robby, SYSTEM, User), emergency mode badge, and text-to-speech playback for Robby's messages when authenticated.",
  "frontend/src/components/InterruptButton.tsx": "Provides a button to interrupt/stop an ongoing debate by canceling speech synthesis and calling the backend abort mutation.",
  "frontend/src/components/PushToTalkButton.tsx": "Implements push-to-talk speech recognition with start/stop controls, processes transcripts on completion, and includes fix to prevent infinite loop by removing transcript from useEffect dependencies.",
  "frontend/src/components/SensoryCortexTab.tsx": "Handles file uploads (drag-drop, manual, camera) with chunked processing (1.8MB chunks), extracts text/image previews, and routes documents to appropriate agents via backend mutation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor with Internet Identity authentication, initializes access control with admin token, and invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login/logout state, identity persistence, and AuthClient configuration with delegation handling.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for debate operations (start, abort, clear, status polling), agent registry management, and document routing with optimized polling intervals to prevent infinite loops.",
  "frontend/src/hooks/useSpeechRecognition.ts": "Custom React hook that wraps the browser's Web Speech Recognition API to provide speech-to-text functionality with state management for listening status, transcript, errors, and browser support detection.",
  "frontend/src/hooks/useSpeechSynthesis.ts": "Custom React hook that wraps the browser's Speech Synthesis API to provide text-to-speech functionality with voice selection (prioritizing British male voices) and speaking state management.",
  "frontend/src/hooks/useWakeWordStub.ts": "Commented-out stub file containing placeholder code for integrating Picovoice Porcupine wake word detection to trigger speech recognition automatically.",
  "frontend/src/index.css": "Global CSS file that imports Tailwind directives and defines CSS custom properties for light and dark theme color schemes using OKLCH color space, plus base typography styles.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient provider for data fetching and InternetIdentityProvider for authentication, then renders the App component.",
  "frontend/src/utils/transcriptParser.ts": "Utility function that sanitizes transcript text by stripping HTML table tags and converting URLs and markdown-style links into clickable anchor elements with styling.",
  "frontend/src/utils/urlParams.ts": "Utility module for extracting and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space with CSS variables, container settings, extended theme properties, animations, and plugin integrations for typography and container queries.",
  "frontend/vite.config.ts": "Vite build configuration for React app with environment variable injection for canister IDs, path aliases, and local development proxy setup for API requests to port 4943.",
  "project_state.json": "Project state tracking file documenting existing features for session management UI (download transcript and clear boardroom functionality) with requirements mapping and feature implementation status."
}