{
  "backend/main.mo": "Main backend actor implementing user profiles, agent registry with pre-populated agents (Skippy, GLaDOS, Robby, etc.), debate state management, file metadata registry, and access control integration with authorization mixins.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend source files including components, hooks, utilities, and configuration files describing UI structure, state management, speech recognition/synthesis, and actor initialization patterns.",
  "frontend/.env": "Local development environment configuration specifying backend canister ID (bkyz2-fmaaa-aaaaa-qaaaq-cai) and DFX network set to local.",
  "frontend/.env.production": "Production environment configuration with the same canister ID and DFX network set to 'ic' for Internet Computer mainnet deployment.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color palette defining CSS variables for light and dark modes with neutral grayscale theme suitable for technical infrastructure UI.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx, titled 'The Gang'.",
  "frontend/src/App.tsx": "Main React application component with three tabs (Boardroom, Sensory Cortex, Swarm Health), authentication UI, and BoardroomTab featuring text command console with Enter-to-send, push-to-talk, debate display, and transcript download/clear functionality.",
  "frontend/src/components/AgentRegistryTable.tsx": "Agent registry table component displaying system infrastructure vitals cards (Orchestrator Core, Telemetry Side Master), agent status table with kill switches, memory usage progress bars, and crash log modal integration with tactical dark aesthetic.",
  "frontend/src/components/CrashLogModal.tsx": "Modal dialog component displaying agent diagnostics with monospace terminal styling, showing agent ID, status, and telemetry logs in a dark-themed scrollable container.",
  "frontend/src/components/DebateDisplay.tsx": "Displays the debate transcript in a scrollable card with speaker badges, text-to-speech controls, and emergency mode indicator. Parses transcript lines by speaker (Skippy, GLaDOS, Robby, SYSTEM, User) and auto-scrolls to latest messages.",
  "frontend/src/components/InterruptButton.tsx": "Provides a button to interrupt/stop an active debate by canceling speech synthesis and calling the backend abort mutation. Shows loading state during interruption.",
  "frontend/src/components/PushToTalkButton.tsx": "Implements push-to-talk speech recognition with visual feedback (pulsing when listening). Processes transcript on stop and prevents duplicate submissions using a ref to track last processed text.",
  "frontend/src/components/SensoryCortexTab.tsx": "Handles file uploads (drag-drop, manual, camera) by chunking large files into 1.8MB pieces and routing them to appropriate agents. Supports text and image files with preview generation and progress tracking.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance with Internet Identity authentication. Invalidates dependent queries when actor changes and initializes access control with admin token from URL params.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login/logout state and identity persistence. Creates AuthClient with configurable options and tracks login status through various states.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including debate status polling, starting/aborting debates, clearing boardroom, routing documents, and managing agent statuses. Includes automatic query invalidation on mutations.",
  "frontend/src/hooks/useSpeechRecognition.ts": "React hook for browser-based speech recognition using Web Speech API. Provides start/stop controls, transcript state, error handling, and uses functional state updates to prevent stale closure issues.",
  "frontend/src/hooks/useSpeechSynthesis.ts": "React hook for text-to-speech using Web Speech Synthesis API. Supports voice selection with preference for British male voices and provides speak/cancel controls with speaking state tracking.",
  "frontend/src/hooks/useWakeWordStub.ts": "Commented-out stub for future Picovoice Porcupine wake word detection integration. Contains placeholder code for triggering speech recognition automatically on wake word detection.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark theme color tokens using OKLCH color space. Defines design system tokens for backgrounds, borders, charts, and semantic colors.",
  "frontend/src/main.tsx": "Application entry point that renders the root React component with QueryClient and InternetIdentityProvider context wrappers.",
  "frontend/src/utils/transcriptParser.ts": "Utility function that sanitizes HTML table tags from text and converts URLs and markdown-style links into clickable anchor elements with styling.",
  "frontend/src/utils/urlParams.ts": "URL parameter utilities for extracting query parameters from both regular and hash-based routing, with sessionStorage persistence support and functions to clear sensitive parameters from the URL.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color palette using OKLCH variables, container settings, border radius tokens, animations, and plugins for typography, container queries, and animations.",
  "frontend/vite.config.ts": "Vite build configuration with React plugin, environment variable injection for canister IDs, path aliases, and local development proxy for API requests to dfx replica.",
  "project_state.json": "Project metadata documenting a single-user Internet Identity-secured application with removed auth checks, locked Golden Master backend (v56), multi-canister telemetry architecture, and frontend-only monitoring UI with existing features list."
}