{
  "backend/main.mo": "Main backend actor implementing debate management, agent registry with 9 pre-populated agents, user profiles, file metadata storage, and access control with admin/user permissions using mixins for authorization and blob storage.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features documented.",
  "frontend-file-summaries.txt": "JSON-formatted documentation of frontend component summaries describing authentication flows, debate state management, speech recognition/synthesis, file upload chunking, and agent registry UI with tactical dark aesthetic.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH-based neutral grayscale color palette defining CSS custom properties for light and dark modes with sidebar, chart, and UI component theming.",
  "frontend/index.html": "HTML entry point for 'The Gang' application with root div and module script loading main.tsx.",
  "frontend/src/App.tsx": "Main React application component with three tabs (boardroom, sensory, health), Internet Identity authentication, debate state management with strict four-state rendering, push-to-talk transcript handling with try/catch/finally error handling, and backend actor initialization guards.",
  "frontend/src/components/AgentRegistryTable.tsx": "Agent registry table component displaying agents from backend with real-time status indicators (green/red), kill switch toggles using shadcn Switch, tactical dark aesthetic with sharp borders, and backend actor initialization guard clauses.",
  "frontend/src/components/DebateDisplay.tsx": "Debate transcript display component parsing multi-line speaker messages (Skippy, GLaDOS, Robby, SYSTEM, User) with color-coded cards, emergency mode badge, and text-to-speech button for Robby's responses.",
  "frontend/src/components/InterruptButton.tsx": "Interrupt button component that cancels active speech synthesis and calls backend abortDebate mutation to stop ongoing debates.",
  "frontend/src/components/PushToTalkButton.tsx": "React component that provides a push-to-talk button using speech recognition, with visual feedback during listening and automatic transcript completion callback when recording stops.",
  "frontend/src/components/SensoryCortexTab.tsx": "File upload component supporting drag-and-drop, camera capture, and chunked uploads (1.8MB chunks) with file preview extraction for text/image files and routing to backend agents.",
  "frontend/src/hooks/useActor.ts": "React Query hook that manages the backend actor instance with Internet Identity authentication, initializes access control with admin token, and invalidates dependent queries on actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication using @dfinity/auth-client, managing login state, identity persistence, and delegation validation.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend operations including debate status polling, starting/aborting debates, document routing, and agent status management with automatic cache invalidation.",
  "frontend/src/hooks/useSpeechRecognition.ts": "React hook wrapping the Web Speech Recognition API for voice input, managing listening state, transcript capture, and error handling with automatic cleanup.",
  "frontend/src/hooks/useSpeechSynthesis.ts": "React hook for text-to-speech using Web Speech Synthesis API with voice selection support, prioritizing British male voices, and managing speaking state.",
  "frontend/src/hooks/useWakeWordStub.ts": "Commented-out stub for future wake word detection integration using @picovoice/porcupine-react library.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components, charts, and typography.",
  "frontend/src/main.tsx": "React application entry point that sets up the root with QueryClient for data fetching and InternetIdentityProvider for authentication, then renders the App component.",
  "frontend/src/utils/transcriptParser.ts": "Utility function that sanitizes transcript text by stripping HTML table tags and converting URLs and markdown-style links into clickable anchor elements with styling.",
  "frontend/src/utils/urlParams.ts": "Comprehensive URL parameter management utilities supporting both regular query strings and hash-based routing, with sessionStorage persistence for parameters like admin tokens across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a custom design system with OKLCH color variables, extended theme tokens for UI components (sidebar, chart, card, etc.), custom animations, and typography/container plugins.",
  "project_state.json": "Project metadata describing The Gang multi-agent system architecture with 8 AI agent canisters plus 1 ingestion canister on Internet Computer, including sovereignty constraints, storage limits, known IC0536 error, and implemented features for dashboard, polling, and speech interaction."
}