{
  "backend/main.mo": "Main backend actor implementing user profiles, agent registry with pre-populated agents (Skippy, GLaDOS, Robby, etc.), debate state management, file metadata storage, and access-controlled endpoints for toggling agents, managing debates, and resetting agents.",
  "feature_evidence.json": "Feature evidence report documenting two high-confidence features: adding a useResetAgents mutation hook in useQueries.ts and adding a Reset Agents button in AgentRegistryTable.tsx.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, hooks, utilities, and configuration files with details on React Query integration, speech APIs, and agent management UI.",
  "frontend/.env": "Development environment configuration file specifying local backend canister ID (bkyz2-fmaaa-aaaaa-qaaaq-cai) and DFX network set to local.",
  "frontend/.env.production": "Production environment configuration file with the same canister ID and DFX network set to 'ic' for mainnet deployment.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color palette defining neutral grayscale design tokens for light and dark modes suitable for technical infrastructure UI.",
  "frontend/index.html": "HTML entry point for the application titled 'The Gang' with a root div and module script loading main.tsx.",
  "frontend/src/App.tsx": "Main application component with three tabs (Boardroom, Sensory Cortex, Swarm Health), authentication handling, debate management with push-to-talk and text input, and transcript download functionality.",
  "frontend/src/components/AgentRegistryTable.tsx": "Agent registry table displaying system vitals, agent status with kill switches, memory usage, diagnostics modal, and a Reset Agents button positioned above the System Vitals section that triggers the reset mutation.",
  "frontend/src/components/CrashLogModal.tsx": "Dialog modal component displaying agent diagnostics and telemetry information with monospace styling and green terminal aesthetics.",
  "frontend/src/components/DebateDisplay.tsx": "Displays a debate transcript in a card with color-coded speaker badges (Skippy, GLaDOS, Robby, SYSTEM), text-to-speech controls for each message, and auto-scrolling. Shows emergency mode indicator when active.",
  "frontend/src/components/InterruptButton.tsx": "Provides a button to interrupt/stop an ongoing debate by canceling speech synthesis and calling the backend abort mutation.",
  "frontend/src/components/PushToTalkButton.tsx": "Implements a push-to-talk button using speech recognition that starts/stops listening on click and calls a callback with the transcript when recording stops.",
  "frontend/src/components/SensoryCortexTab.tsx": "Handles file uploads (drag-drop, manual, camera) by chunking large files and routing them to appropriate agents via backend, with progress tracking and preview generation for text/images.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance with authentication, initializing access control with admin token and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and delegation validity checks.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including debate management (start, abort, clear, status), document routing, and agent registry management (get, toggle, reset).",
  "frontend/src/hooks/useSpeechRecognition.ts": "React hook wrapping the Web Speech Recognition API with state management for listening status, transcript, errors, and support detection. Uses functional state updates to prevent stale closure issues and provides start/stop controls.",
  "frontend/src/hooks/useSpeechSynthesis.ts": "React hook wrapping the Web Speech Synthesis API with voice selection logic prioritizing British male voices. Provides speak/cancel functions and tracks speaking state.",
  "frontend/src/hooks/useWakeWordStub.ts": "Commented-out stub for future Picovoice Porcupine wake word detection integration. Contains placeholder code for triggering speech recognition on wake word detection.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark theme colors using OKLCH color space. Defines design tokens for UI components and charts.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider context wrappers before rendering the App component.",
  "frontend/src/utils/transcriptParser.ts": "Utility function that sanitizes transcript text by stripping HTML table tags and converting URLs and markdown-style links into clickable anchor elements with styling.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and persisting URL parameters from both query strings and hash-based routing, with sessionStorage integration for parameter persistence across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH variables, container settings, extended animations, and plugins for typography, container queries, and animations.",
  "frontend/vite.config.ts": "Vite build configuration with React plugin, environment variable injection for canister IDs, path aliases, and local development proxy for API requests to dfx replica.",
  "project_state.json": "Project metadata documenting a single-user Internet Identity-secured application with removed auth checks, locked Golden Master backend (v56), multi-canister telemetry architecture, and frontend-only monitoring UI with mock data."
}