{
  "backend/main.mo": "Main backend actor combining authorization, blob storage, and debate management with pre-populated agent registry, user profiles, file metadata tracking, and debate state control including emergency mode and transcript handling.",
  "feature_evidence.json": "Feature evidence report documenting two high-confidence frontend fixes: try/catch/finally error handling with state reset in handlePushToTalk, and transcript clearing at function start.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files describing their functionality, error handling, state management, and UI components.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH-based neutral grayscale color palette supporting light and dark modes for a technical backend infrastructure aesthetic.",
  "frontend/index.html": "HTML entry point for 'The Gang' application with root div and TypeScript module script reference.",
  "frontend/src/App.tsx": "Main React application component with three-tab interface (boardroom, sensory, health), Internet Identity authentication, debate state management, comprehensive error handling with try/catch/finally blocks, and backend actor initialization guards.",
  "frontend/src/components/AgentRegistryTable.tsx": "Agent registry table component displaying agent statuses with real-time indicators, kill switch toggles using shadcn Switch, tactical dark aesthetic, and backend actor initialization guard clauses with loading/error states.",
  "frontend/src/components/DebateDisplay.tsx": "Displays live debate status, current speaker, and transcript stream with auto-scrolling. Uses speech synthesis to speak Robby's responses with a British male voice when Robby becomes the speaker.",
  "frontend/src/components/InterruptButton.tsx": "Provides a button to interrupt/stop the debate by canceling speech synthesis and calling the backend's abortDebate mutation.",
  "frontend/src/components/PushToTalkButton.tsx": "Implements a push-to-talk button using speech recognition that captures user voice input and triggers a callback with the transcript when recording stops.",
  "frontend/src/components/SensoryCortexTab.tsx": "Handles file upload via drag-and-drop or file input, chunks large files into 1.8MB pieces, extracts previews from text/images, and routes documents to the backend for agent processing.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance with Internet Identity authentication, initializes access control with admin token, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login/logout state, identity persistence, and AuthClient configuration with custom idle options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for debate operations (start, abort, status polling), document routing, and agent registry management with automatic cache invalidation.",
  "frontend/src/hooks/useSpeechRecognition.ts": "Wraps the Web Speech Recognition API in a React hook, providing start/stop controls, transcript state, error handling, and browser support detection for voice input.",
  "frontend/src/hooks/useSpeechSynthesis.ts": "React hook that wraps the Web Speech Synthesis API to provide text-to-speech functionality with support for British male voice selection, speaking state tracking, and voice cancellation.",
  "frontend/src/hooks/useWakeWordStub.ts": "Commented-out stub file for future integration of Picovoice Porcupine wake word detection to trigger speech recognition automatically.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark theme color schemes using OKLCH color space, including design tokens for UI components and charts.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient provider for React Query and InternetIdentityProvider for IC authentication.",
  "frontend/src/utils/transcriptParser.ts": "Utility function that sanitizes transcript text by removing HTML table tags and converting URLs and markdown-style links into clickable anchor elements.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage integration for parameter persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH color space, container settings, border radius variables, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing The Gang multi-agent system architecture with 9 canisters on Internet Computer, including known issues like White Screen of Death regression, transcript state persistence bug, and agent registry false offline status."
}