{
  "backend/main.mo": "Main Motoko actor implementing a multi-agent debate system with access control, blob storage mixins, user profiles, agent registry with 9 pre-populated agents (Skippy, GLaDOS, Robby, etc.), debate state management with emergency mode, and file metadata tracking.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "Comprehensive documentation of frontend component architecture including React hooks, speech recognition/synthesis, debate display, file ingestion with chunking, agent registry table, and configuration files with detailed implementation notes.",
  "frontend/.env": "Local development environment configuration specifying backend canister ID (bkyz2-fmaaa-aaaaa-qaaaq-cai) and DFX network set to local.",
  "frontend/.env.production": "Production environment configuration with the same canister ID and DFX network set to 'ic' for Internet Computer mainnet.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH-based neutral grayscale color palette defining CSS custom properties for light and dark modes, including sidebar, chart, and destructive color variants.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx, titled 'The Gang'.",
  "frontend/src/App.tsx": "Main React application component with tab navigation (boardroom, sensory, health), authentication checks, debate state management, push-to-talk functionality, and emergency mode alerts with strict hook ordering and error handling.",
  "frontend/src/components/AgentRegistryTable.tsx": "Agent registry table component displaying agent status with kill switch toggles, tactical dark aesthetic with neon green accents, loading states, and comprehensive error handling with finally blocks to prevent stuck UI states.",
  "frontend/src/components/DebateDisplay.tsx": "Debate transcript display component with speaker-specific color coding (Skippy/blue, GLaDOS/purple, Robby/green), text-to-speech button for Robby's responses, emergency mode badge, and fixed minimum height to prevent layout shifts.",
  "frontend/src/components/InterruptButton.tsx": "A destructive button component that stops speech synthesis and calls the backend to abort an ongoing debate when clicked.",
  "frontend/src/components/PushToTalkButton.tsx": "A button component that toggles speech recognition on/off, displays listening state with animation, and calls a callback with the transcript when recording stops.",
  "frontend/src/components/SensoryCortexTab.tsx": "A file upload component supporting drag-and-drop, camera capture, and manual selection that chunks large files (1.8MB per chunk) and routes documents to backend agents with progress tracking.",
  "frontend/src/hooks/useActor.ts": "A React Query hook that creates and manages an authenticated or anonymous actor instance, initializing access control and invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "A React context provider and hook for Internet Identity authentication, managing login/logout flow, identity persistence, and authentication status with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for debate operations (start, abort, status polling), document routing, and agent registry management with automatic cache invalidation.",
  "frontend/src/hooks/useSpeechRecognition.ts": "A hook wrapping the Web Speech Recognition API with start/stop controls, transcript state management, error handling, and functional updates to prevent stale closure issues.",
  "frontend/src/hooks/useSpeechSynthesis.ts": "A hook wrapping the Web Speech Synthesis API with voice selection (preferring British male voices), speak/cancel controls, and speaking state tracking.",
  "frontend/src/hooks/useWakeWordStub.ts": "A commented-out stub for future Picovoice Porcupine wake word detection integration that would trigger speech recognition automatically.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components (primary, secondary, destructive, charts, etc.) and base styles for body and code elements.",
  "frontend/src/main.tsx": "React application entry point that sets up the root with QueryClientProvider for data fetching and InternetIdentityProvider for authentication, then renders the App component.",
  "frontend/src/utils/transcriptParser.ts": "Utility function that sanitizes transcript text by removing HTML table tags and converting URLs and markdown-style links into clickable anchor elements with styling.",
  "frontend/src/utils/urlParams.ts": "Comprehensive URL parameter utilities for extracting query parameters from both regular and hash-based routing, with sessionStorage persistence support and functions to clear parameters from URLs and storage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme extensions including OKLCH color system, container settings, border radius variables, custom shadows, and accordion animations, with typography and container-queries plugins.",
  "frontend/vite.config.ts": "Vite build configuration for React app with environment variable injection for canister IDs, path aliases, and local development proxy to ICP backend on port 4943.",
  "project_state.json": "Project state tracking document indicating a fix request to make the backend agents map mutable by changing from 'let' to 'var' and ensuring proper reassignment in toggleAgentStatus function."
}