{
  "backend/main.mo": "Main Motoko actor implementing a multi-agent debate system with user profiles, agent registry (9 pre-populated agents with different types), debate state management, file metadata storage, and role-based access control using authorization and blob-storage mixins.",
  "feature_evidence.json": "Feature evidence report documenting four specific code changes in frontend/src/App.tsx: removing transcript clearing, removing error handling wrapper, restoring useEffect dependencies, and changing button onClick syntax.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of 12 frontend files describing React components, hooks, and utilities for a voice-enabled debate system with speech recognition, agent management, file upload, and authentication.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH-based neutral grayscale color palette defining CSS custom properties for light and dark modes, including sidebar, chart, and destructive color variants.",
  "frontend/index.html": "Minimal HTML entry point with UTF-8 charset, viewport meta tag, title 'The Gang', and script loading main.tsx module.",
  "frontend/src/App.tsx": "Main React application component with three tabs (boardroom, sensory, health), Internet Identity authentication, debate status polling, push-to-talk transcript handling, and emergency mode alerts with strict hook ordering before conditional returns.",
  "frontend/src/components/AgentRegistryTable.tsx": "React component rendering a tactical dark-themed table of agents with real-time status indicators and kill switch toggles, including comprehensive error handling and loading states with finally blocks to prevent stuck UI.",
  "frontend/src/components/DebateDisplay.tsx": "Displays a scrollable debate transcript with color-coded messages by speaker (Skippy, GLaDOS, Robby, SYSTEM, User), emergency mode badge, and text-to-speech playback for Robby's messages when authenticated.",
  "frontend/src/components/InterruptButton.tsx": "Provides a destructive-styled button that cancels active speech synthesis and calls the backend to abort the ongoing debate when clicked.",
  "frontend/src/components/PushToTalkButton.tsx": "Implements a push-to-talk button using speech recognition that starts/stops listening on click and invokes a callback with the transcript when recording completes, with duplicate prevention logic.",
  "frontend/src/components/SensoryCortexTab.tsx": "Handles file uploads (drag-drop, manual, camera) by chunking files into 1.8MB pieces, generating previews for text/images, and routing documents to agents via backend mutation with progress tracking.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance with Internet Identity authentication, initializing access control with an admin token and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login/logout flow, identity persistence, and authentication status with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for debate operations (start, abort, status polling), document routing, and agent registry management with automatic cache invalidation on mutations.",
  "frontend/src/hooks/useSpeechRecognition.ts": "Wraps the Web Speech Recognition API in a React hook with start/stop controls, transcript state management, error handling, and functional state updates to prevent stale closure issues.",
  "frontend/src/hooks/useSpeechSynthesis.ts": "React hook that wraps the Web Speech API for text-to-speech functionality, with support for selecting British male voices and managing speech state (isSpeaking, isSupported).",
  "frontend/src/hooks/useWakeWordStub.ts": "Commented-out stub file for future integration of Picovoice Porcupine wake word detection to trigger speech recognition automatically.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark theme colors using OKLCH color space, including design tokens for borders, backgrounds, and chart colors.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for React Query and InternetIdentityProvider for IC authentication.",
  "frontend/src/utils/transcriptParser.ts": "Utility function that sanitizes transcript text by removing HTML table tags and converting URLs and markdown links into clickable anchor elements.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support for parameters like admin tokens.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme extensions with OKLCH color system, container settings, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing The Gang multi-agent system architecture with 8 AI agents plus 1 ingestion canister on Internet Computer, including known issues with SwarmHealth toggles, loading states, and layout shifts."
}