{
  "backend/main.mo": "Main Motoko actor managing debate state with methods to get status, start debates (with HEM_Override_Key emergency detection), abort debates, and top-up canisters; includes migration support.",
  "backend/migration.mo": "Migration module that preserves DebateState during canister upgrades by copying currentState from old actor to new actor.",
  "feature_evidence.json": "Feature evidence report documenting two high-confidence features: Internet Identity integration with login button (REQ-36) and High-Stakes UI lock for authenticated-only transcript/TTS access (REQ-37).",
  "frontend-file-summaries.txt": "JSON-formatted summaries of 11 frontend files covering authentication, voice recognition, TTS, debate display with auth-gated content, and UI components.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH-based neutral grayscale design system supporting light and dark modes for technical infrastructure aesthetics.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx for 'The Gang' application.",
  "frontend/src/App.tsx": "Main application component with Internet Identity authentication UI (prominent login/logout button), push-to-talk interface, debate monitoring, interrupt controls, and authentication status badges with visual feedback.",
  "frontend/src/components/DebateDisplay.tsx": "Real-time debate display with High-Stakes UI lock that blurs/hides Robby's transcript and disables TTS when unauthenticated, showing locked overlay with authentication requirement.",
  "frontend/src/components/InterruptButton.tsx": "Interrupt button component that cancels active speech synthesis and calls backend abort_debate to immediately stop debates.",
  "frontend/src/components/PushToTalkButton.tsx": "Push-to-talk button using browser SpeechRecognition API with visual feedback during recording and automatic transcript capture on completion.",
  "frontend/src/hooks/useActor.ts": "React Query hook managing backend actor creation with Internet Identity integration, automatically recreating actor when identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for debate operations: useDebateStatus polls backend every 500ms, useStartBoardroomDebate initiates debates, and useAbortDebate interrupts them.",
  "frontend/src/hooks/useSpeechRecognition.ts": "Custom hook wrapping browser SpeechRecognition API for voice input, providing start/stop controls, transcript state, and error handling with browser compatibility detection.",
  "frontend/src/hooks/useSpeechSynthesis.ts": "Custom hook for text-to-speech using browser SpeechSynthesis API, with voice selection logic prioritizing British male voices and providing speak/cancel controls.",
  "frontend/src/hooks/useWakeWordStub.ts": "Commented-out stub for future Picovoice Porcupine wake word detection integration to trigger speech recognition automatically.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark theme colors using OKLCH color space, including design tokens for UI components.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/utils/transcriptParser.ts": "Utility function that sanitizes transcript text by removing HTML table tags and converting URLs and markdown links to clickable anchor elements.",
  "frontend/tailwind.config.js": "Tailwind configuration defining custom color scheme using OKLCH, container settings, border radius variables, animations, and plugins for typography and container queries.",
  "project_state.json": "Project metadata describing The Gang multi-agent system architecture with 9 canisters, sovereignty constraints, storage limits, inter-canister communication patterns, and implemented features including real-time debate UI with speech recognition."
}