{
  "backend/main.mo": "Main backend actor implementing debate management, agent registry with pre-populated agents (Skippy, GLaDOS, Robby, etc.), user profiles, file metadata storage, and access control using mixins for authorization and blob storage.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features documented.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, hooks, configuration, and utilities for a debate/agent management application with speech recognition, file upload, and agent health monitoring.",
  "frontend/.env": "Local development environment configuration specifying backend canister ID and DFX network set to local.",
  "frontend/.env.production": "Production environment configuration specifying backend canister ID and DFX network set to IC mainnet.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color palette defining CSS variables for light and dark modes with neutral grayscale theme for technical infrastructure UI.",
  "frontend/index.html": "HTML entry point for the application titled 'The Gang' with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Main React application component with three tabs (Boardroom, Sensory Cortex, Swarm Health), authentication handling, debate management with voice/text input, transcript download, and agent registry display.",
  "frontend/src/components/AgentRegistryTable.tsx": "Agent registry table displaying system vitals, agent status with toggle switches, memory usage progress bars, diagnostics modal, and reset agents button with toast notifications.",
  "frontend/src/components/CrashLogModal.tsx": "Dialog modal component displaying agent diagnostics and telemetry information with monospace terminal-style styling in green/black theme.",
  "frontend/src/components/DebateDisplay.tsx": "Displays the debate transcript in a card with speaker badges (Skippy, GLaDOS, Robby, SYSTEM), text-to-speech controls for each message, and auto-scrolling. Shows emergency mode indicator when active.",
  "frontend/src/components/InterruptButton.tsx": "Provides a button to interrupt/stop an active debate by canceling speech synthesis and calling the backend abort mutation.",
  "frontend/src/components/PushToTalkButton.tsx": "Implements push-to-talk speech recognition with a button that toggles listening state and calls a callback with the transcript when recording stops.",
  "frontend/src/components/SensoryCortexTab.tsx": "Handles file uploads (drag-drop, manual, camera) by chunking large files and routing them to appropriate agents via the backend, with progress tracking and preview generation for text/images.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance with authentication, initializing access control and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context with login/logout functionality, identity management, and status tracking using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including debate status polling, starting/aborting debates, document routing, and agent management (status toggling, reset).",
  "frontend/src/hooks/useSpeechRecognition.ts": "Custom React hook that wraps the browser's Web Speech API for speech recognition, providing start/stop controls, transcript state, error handling, and browser support detection with functional state updates to prevent stale closures.",
  "frontend/src/hooks/useSpeechSynthesis.ts": "Custom React hook for text-to-speech using the browser's Speech Synthesis API, with voice selection logic prioritizing British male voices and providing speak/cancel controls.",
  "frontend/src/hooks/useWakeWordStub.ts": "Commented-out stub file with TODO note for future integration of Picovoice Porcupine wake word detection to trigger speech recognition automatically.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes using OKLCH color space, defining design tokens for colors, borders, and animations.",
  "frontend/src/main.tsx": "Application entry point that renders the root React component with QueryClient and InternetIdentityProvider wrappers for state management and authentication.",
  "frontend/src/utils/transcriptParser.ts": "Utility function that sanitizes transcript text by stripping HTML table tags and converting URLs and markdown-style links into clickable anchor elements.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme extensions including OKLCH color system, container settings, border radius variables, shadows, and animations with typography and container query plugins.",
  "frontend/vite.config.ts": "Vite build configuration for React app with environment variable injection, path aliases, canister ID definitions, and local development proxy for API requests.",
  "project_state.json": "Project state file defining three pending architectural requirements to update the useActor hook by adding useState import, creating telemetryActor state, and updating the return statement to include telemetryActor."
}