{
  "backend/main.mo": "Main backend actor implementing debate orchestration, agent registry with pre-populated agents (Skippy, GLaDOS, Robby, etc.), user profile management, file metadata storage, and access control with admin/user permissions.",
  "feature_evidence.json": "Feature evidence report documenting three high-confidence requirements for wrapping backend.start_boardroom_debate() in try/catch/finally with error logging and state reset in frontend/src/App.tsx.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing React components, hooks, and utilities with emphasis on error handling, state management, and UI behavior fixes.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH-based neutral grayscale color palette supporting light and dark modes for a technical backend infrastructure aesthetic.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx for 'The Gang' application.",
  "frontend/src/App.tsx": "Main React application component with tab navigation (boardroom, sensory, health), Internet Identity authentication, debate orchestration with handleTranscriptComplete callback wrapped in try/catch/finally for error handling and state reset.",
  "frontend/src/components/AgentRegistryTable.tsx": "Agent registry table component displaying agent status with kill switch toggles, comprehensive error handling in toggle operations with finally block ensuring updatingId state reset, and tactical dark aesthetic.",
  "frontend/src/components/DebateDisplay.tsx": "Displays a debate transcript with color-coded messages from different speakers (Skippy, GLaDOS, Robby, SYSTEM, User), showing emergency mode badge when active and providing text-to-speech playback for Robby's messages when authenticated.",
  "frontend/src/components/InterruptButton.tsx": "Provides a button to interrupt/stop an ongoing debate by canceling speech synthesis and calling the backend's abort debate mutation.",
  "frontend/src/components/PushToTalkButton.tsx": "Implements a push-to-talk button for speech recognition that starts/stops listening and calls onTranscriptComplete callback when speech recognition stops with a new transcript, using a ref to prevent duplicate processing.",
  "frontend/src/components/SensoryCortexTab.tsx": "Handles file upload functionality with drag-and-drop, camera capture, and manual selection, processing files in 1.8MB chunks and routing documents to appropriate agents based on file type and content preview.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance with Internet Identity authentication, initializing access control with admin token and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality, managing auth client creation, identity persistence, and authentication status throughout the application.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for backend operations including debate status polling, starting boardroom debates, aborting debates, routing documents, and managing agent statuses with automatic query invalidation on mutations.",
  "frontend/src/hooks/useSpeechRecognition.ts": "Wraps the Web Speech Recognition API in a React hook with start/stop controls, using functional state updates to prevent stale closure issues and providing transcript, error state, and browser support detection.",
  "frontend/src/hooks/useSpeechSynthesis.ts": "React hook that wraps the Web Speech API for text-to-speech, providing speak/cancel functions with British male voice preference and state tracking for isSpeaking.",
  "frontend/src/hooks/useWakeWordStub.ts": "Commented-out stub file with TODO to integrate Picovoice Porcupine wake word detection for triggering speech recognition automatically.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark theme colors using OKLCH color space, including design tokens for UI components.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/utils/transcriptParser.ts": "Utility function that sanitizes transcript text by removing HTML table tags and converting URLs and markdown links into clickable anchor elements.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support for parameters like admin tokens.",
  "frontend/tailwind.config.js": "Tailwind configuration defining custom color scheme using OKLCH variables, container settings, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata tracking a known issue with frozen UI when backend.start_boardroom_debate() fails, with three existing features implementing try/catch/finally error handling in handleTranscriptComplete."
}