{
  "backend/main.mo": "Main Motoko actor implementing a multi-agent debate system with user profiles, file registry, agent management (9 pre-populated agents with types), debate state tracking, and access control using mixins for authorization and blob storage.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files documenting React components, hooks, utilities, and configuration for a multi-agent debate system with speech recognition, file upload, and agent management features.",
  "frontend/.env": "Local development environment configuration specifying backend canister ID and DFX network set to 'local'.",
  "frontend/.env.production": "Production environment configuration specifying backend canister ID and DFX network set to 'ic' for mainnet deployment.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color palette defining neutral grayscale design tokens for light and dark modes with sidebar, chart, and destructive color variants.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx for the React application titled 'The Gang'.",
  "frontend/src/App.tsx": "Main React application component with three tabs (Boardroom, Sensory Cortex, Swarm Health), authentication via Internet Identity, debate controls including push-to-talk and text command input, and transcript download functionality.",
  "frontend/src/components/AgentRegistryTable.tsx": "Agent registry table displaying system infrastructure vitals with toggle switches for enabling/disabling agents, memory usage progress bars, diagnostics modal, and a reset agents button.",
  "frontend/src/components/CrashLogModal.tsx": "Modal dialog displaying agent diagnostics with terminal-style UI showing agent ID, status, and telemetry information in a monospace green-on-black theme.",
  "frontend/src/components/DebateDisplay.tsx": "Displays the debate transcript in a scrollable card with speaker badges (Skippy, GLaDOS, Robby, SYSTEM), text-to-speech controls for each message, and an emergency mode indicator. Auto-scrolls to the latest message when the transcript updates.",
  "frontend/src/components/InterruptButton.tsx": "Provides a button to interrupt/stop an active debate by canceling speech synthesis and calling the backend abort mutation. Shows loading state while the abort request is pending.",
  "frontend/src/components/PushToTalkButton.tsx": "Implements a push-to-talk button using speech recognition that starts/stops listening on click and calls onTranscriptComplete callback when speech recognition stops with new transcript. Includes error handling and browser support detection.",
  "frontend/src/components/SensoryCortexTab.tsx": "Handles file uploads (drag-drop, manual, camera) by chunking large files and routing them to appropriate agents via the backend. Shows upload progress, supports text and image file types, and requires authentication.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance with authentication, initializing access control with admin token and invalidating dependent queries when the actor or identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout, managing identity state and auth client lifecycle with configurable options for idle handling and delegation.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including debate status polling, starting/aborting debates, document routing, agent status management, and boardroom clearing with automatic cache invalidation.",
  "frontend/src/hooks/useSpeechRecognition.ts": "React hook that wraps the Web Speech Recognition API to provide voice input functionality with start/stop controls, transcript state, error handling, and browser support detection.",
  "frontend/src/hooks/useSpeechSynthesis.ts": "React hook that wraps the Web Speech Synthesis API to provide text-to-speech functionality with voice selection (preferring British male voices) and speaking state management.",
  "frontend/src/hooks/useWakeWordStub.ts": "Commented-out stub for future integration of Picovoice Porcupine wake word detection to trigger speech recognition automatically.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark theme colors using OKLCH color space, plus base typography and code font styles.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/src/utils/transcriptParser.ts": "Utility function that sanitizes transcript text by removing HTML table tags and converting URLs and markdown links into clickable anchor elements.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color tokens using OKLCH, container settings, border radius variables, animations, and plugin integrations for typography and container queries.",
  "frontend/vite.config.ts": "Vite build configuration with React plugin, environment variable injection for canister IDs, path aliases, and local development proxy for API calls.",
  "project_state.json": "Project metadata documenting the single-user Internet Identity-secured architecture, removal of all backend permission checks, locked Golden Master backend (v56), multi-canister telemetry setup, and existing features list."
}