{
  "backend/main.mo": "Main Motoko actor implementing a multi-agent debate system with access control, blob storage mixins, user profiles, agent registry with 9 pre-populated agents (Skippy, GLaDOS, Robby, etc.), debate state management, and file metadata tracking.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend TypeScript/React components, hooks, and configuration files describing their functionality, bug fixes, and implementation details.",
  "frontend/.env": "Local development environment variables defining the backend canister ID (bkyz2-fmaaa-aaaaa-qaaaq-cai) and DFX network set to local.",
  "frontend/.env.production": "Production environment variables with the same backend canister ID and DFX network set to 'ic' for Internet Computer mainnet.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color palette defining CSS variables for light and dark mode themes using neutral grayscale values.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx, titled 'The Gang'.",
  "frontend/src/App.tsx": "Main React application component with tab navigation (boardroom, sensory, health), authentication checks, debate management with push-to-talk functionality, emergency mode alerts, and strict hook ordering to prevent conditional rendering issues.",
  "frontend/src/components/AgentRegistryTable.tsx": "Agent registry table component displaying agent status with kill switch toggles, loading states, error handling with try/catch/finally blocks, and tactical dark aesthetic with neon green accents.",
  "frontend/src/components/DebateDisplay.tsx": "Debate transcript display component with speaker-specific color coding, text-to-speech functionality for Robby's responses, emergency mode badge, and fixed minimum height to prevent layout shifts.",
  "frontend/src/components/InterruptButton.tsx": "A destructive button component that stops speech synthesis and aborts the debate by calling the backend abort mutation.",
  "frontend/src/components/PushToTalkButton.tsx": "A button component that toggles speech recognition on/off, processes transcripts when listening stops, and prevents duplicate transcript processing using a ref.",
  "frontend/src/components/SensoryCortexTab.tsx": "A file upload component supporting drag-and-drop, camera capture, and manual upload that chunks large files (1.8MB chunks) and routes documents to agents via backend mutation.",
  "frontend/src/hooks/useActor.ts": "A React Query hook that creates and manages the backend actor instance, handling authentication with Internet Identity and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "A context provider and hook for Internet Identity authentication, managing login/logout state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for backend operations including debate status polling, starting/aborting debates, routing documents, and managing agent statuses with automatic cache invalidation.",
  "frontend/src/hooks/useSpeechRecognition.ts": "A hook wrapping the Web Speech Recognition API with start/stop controls, transcript state management, and error handling using functional updates to prevent stale closures.",
  "frontend/src/hooks/useSpeechSynthesis.ts": "A hook wrapping the Web Speech Synthesis API with voice selection (preferring British male voices), speak/cancel controls, and speaking state tracking.",
  "frontend/src/hooks/useWakeWordStub.ts": "A commented-out stub for future Picovoice Porcupine wake word detection integration that would trigger speech recognition automatically.",
  "frontend/src/index.css": "Tailwind CSS configuration file defining CSS custom properties for light and dark themes, including color variables for UI components (background, foreground, primary, secondary, etc.) and base styles for body and code elements.",
  "frontend/src/main.tsx": "React application entry point that sets up the root component with QueryClientProvider for data fetching and InternetIdentityProvider for authentication, then renders the App component.",
  "frontend/src/utils/transcriptParser.ts": "Utility function that sanitizes transcript text by removing HTML table tags and converting URLs and markdown-style links into clickable anchor tags with styling.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme extensions including OKLCH color system, container settings, border radius variables, custom shadows, and accordion animations, with typography and container query plugins.",
  "frontend/vite.config.ts": "Vite build configuration for React app with environment variable injection for canister IDs, path aliases, and proxy setup for local API calls to port 4943.",
  "project_state.json": "Project state tracking document indicating pending work to remove AccessControl traps from backend functions, fix toggleAgentStatus to work without authentication, and add a clearBoardroom function to reset transcript state."
}