{
  "backend/main.mo": "Main Motoko actor implementing debate management, agent registry with enable/disable toggles, user profile management, file metadata storage, and access control integration with admin-only operations for agent initialization and status changes.",
  "feature_evidence.json": "Feature evidence report documenting implementation of AgentRegistryTable component with dynamic agent data fetching, state management, table rendering, and toggle functionality mapped to specific test requirements (REQ-96 through REQ-99).",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing component functionality, including App.tsx with tabbed navigation, AgentRegistryTable with real-time status indicators and kill switches, and various hooks for debate operations and speech APIs.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH-based neutral grayscale color palette supporting light and dark modes for a tactical dark aesthetic technical infrastructure project.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx for 'The Gang' application.",
  "frontend/src/App.tsx": "Main React application component with three-tab navigation (boardroom/sensory/health), Internet Identity authentication, debate controls with push-to-talk and interrupt buttons, emergency mode indicators, and tactical dark UI theme.",
  "frontend/src/components/AgentRegistryTable.tsx": "Agent registry table component fetching agents from backend via useGetAgentStatuses hook, displaying dynamic rows with real-time status indicators (green/red), functional kill switch toggles using shadcn Switch, and comprehensive loading/error guard clauses.",
  "frontend/src/components/DebateDisplay.tsx": "Displays live debate status with transcript, speaker info, and badges; triggers text-to-speech for Robby's responses only when user is authenticated, implementing a 'High-Stakes UI lock'.",
  "frontend/src/components/InterruptButton.tsx": "Provides a button to interrupt/stop the debate by canceling active speech synthesis and calling the backend's abortDebate mutation.",
  "frontend/src/components/PushToTalkButton.tsx": "Implements a push-to-talk button using speech recognition; captures user speech and invokes a callback with the transcript when recognition completes.",
  "frontend/src/components/SensoryCortexTab.tsx": "Handles file upload (drag-and-drop, file input, camera) with chunking at 1.8MB per chunk; extracts file previews and routes documents to backend agents via the routeDocument mutation.",
  "frontend/src/hooks/useActor.ts": "Manages the backend actor instance with Internet Identity authentication; creates anonymous or authenticated actors and initializes access control with an admin token from URL parameters.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for debate operations (start, abort, status polling), document routing, and agent status management, all using the backend actor.",
  "frontend/src/hooks/useSpeechRecognition.ts": "Custom hook wrapping the Web Speech API for speech recognition; provides start/stop controls, transcript state, and error handling with browser compatibility checks.",
  "frontend/src/hooks/useSpeechSynthesis.ts": "React hook that wraps the browser's SpeechSynthesis API to provide text-to-speech functionality with support for British male voice selection, speaking state management, and voice cancellation.",
  "frontend/src/hooks/useWakeWordStub.ts": "Commented-out stub file for future integration of Picovoice Porcupine wake word detection to trigger speech recognition automatically.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark theme color schemes using OKLCH color space, including design tokens for borders, backgrounds, and chart colors.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication context.",
  "frontend/src/utils/transcriptParser.ts": "Utility function that sanitizes transcript text by removing HTML table tags and converting URLs and markdown links into clickable anchor elements.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage integration for parameter persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color tokens using OKLCH color space, container settings, border radius variables, animations, and plugins for typography and container queries.",
  "project_state.json": "Project metadata describing The Gang multi-agent system architecture with 9 canisters on Internet Computer, including architectural constraints, known issues with Swarm Health dashboard, and existing feature implementations."
}