{
  "kind": "build_request",
  "title": "Fix White Screen of Death regression and transcript clearing",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-129",
      "text": "In frontend/src/App.tsx or the component containing the handlePushToTalk function, wrap the await backend.start_boardroom_debate() call in a try/catch/finally block. In the catch block, log the error using console.error() and append 'System Error: Backend connection failed.' to the transcript state. In the finally block, explicitly reset setIsDebating(false) and setIsRecording(false) to unlock the buttons, ensuring this happens even if the backend call throws an error.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-final"
        ],
        "quotes": [
          "Wrap the start_boardroom_debate call in a try/catch/finally block.",
          "In the finally block, you MUST reset setIsDebating(false) so the buttons unlock."
        ]
      },
      "acceptanceCriteria": [
        "The backend.start_boardroom_debate() call is wrapped in a try block",
        "A catch block logs errors and appends 'System Error: Backend connection failed.' to transcript",
        "A finally block explicitly calls setIsDebating(false) and setIsRecording(false)",
        "Buttons remain functional and unlock even when backend throws errors",
        "No White Screen of Death occurs when backend call fails"
      ]
    },
    {
      "id": "REQ-130",
      "text": "In frontend/src/App.tsx or the component containing the handlePushToTalk function, add setTranscript([]) as the very first line of the function before any other logic executes. This clears the transcript state immediately when the user presses Push-to-Talk, ensuring each new recording starts with a completely empty transcript window.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-final"
        ],
        "quotes": [
          "At the very start of the handlePushToTalk function, you must call setTranscript([]);",
          "The transcript window must be wiped clean every time the user starts a new recording."
        ]
      },
      "acceptanceCriteria": [
        "setTranscript([]) is the first line executed in handlePushToTalk",
        "Transcript window displays empty state when Push-to-Talk is pressed",
        "No residual content from previous recordings appears in new sessions",
        "Clearing happens before speech recognition starts"
      ]
    },
    {
      "id": "REQ-131",
      "text": "In backend/main.mo, locate the start_boardroom_debate function. Remove all agent registry lookup checks for Skippy, GLaDOS, and Robby. Hardcode the function to always append the mock responses for these three agents to the transcript in sequential order (Skippy -> GLaDOS -> Robby), regardless of their registry status. Ignore the is_enabled field temporarily to prove the inter-canister routing plumbing works correctly.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-user-final"
        ],
        "quotes": [
          "In the Motoko backend, stop checking the registry for this build.",
          "Hardcode the start_boardroom_debate to return the mock responses for Skippy, GLaDOS, and Robby regardless of registry status.",
          "We need to prove the plumbing works before we re-introduce the registry check."
        ]
      },
      "acceptanceCriteria": [
        "start_boardroom_debate function does not check registry.get() for Skippy, GLaDOS, or Robby",
        "Mock responses for all three agents always append to transcript",
        "Function executes full Skippy -> GLaDOS -> Robby sequence every time",
        "No 'offline' or 'bypassing' messages appear for these agents",
        "Registry status has no effect on debate flow"
      ]
    }
  ],
  "constraints": [
    "Do not remove the agent registry data structure or get_agent_registry function",
    "Do not modify the toggle_agent_status function",
    "Preserve all existing error handling in other components",
    "Keep the emergency mode and Steel Rain override logic intact"
  ],
  "nonGoals": [
    "Re-implementing registry checks in this build",
    "Adding new agent routing logic",
    "Modifying the Speech Recognition or Speech Synthesis APIs",
    "Changing authentication or Internet Identity flows"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}