{
  "kind": "build_request",
  "title": "Remove Principal Input and Fix Upload Button in Sensory Cortex",
  "projectName": "The Gang",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-84",
      "text": "Delete the entire 'SENSORY CORTEX CANISTER PRINCIPAL' input field and its associated state variable from the SensoryCortexTab component (frontend/src/components/SensoryCortexTab.tsx)",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Delete the entire \"SENSORY CORTEX CANISTER PRINCIPAL\" input field and its associated state from the UI."
        ]
      },
      "acceptanceCriteria": [
        "The Principal input field is completely removed from the UI",
        "All state variables related to Principal ID are deleted",
        "No visual trace of the Principal input remains in the Sensory Cortex tab"
      ]
    },
    {
      "id": "REQ-85",
      "text": "Remove all validation logic that disables the 'START UPLOAD' button based on a Principal ID. The ONLY requirement for the 'START UPLOAD' button to be active is that a file is selected (if (selectedFile !== null))",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Remove any validation logic that disables the \"START UPLOAD\" button based on a Principal ID. The ONLY requirement for the \"START UPLOAD\" button to be active is that a file is selected (if (selectedFile !== null))."
        ]
      },
      "acceptanceCriteria": [
        "The START UPLOAD button is enabled when selectedFile is not null",
        "The START UPLOAD button is disabled only when no file is selected",
        "No Principal ID validation exists in the button's disabled logic"
      ]
    },
    {
      "id": "REQ-86",
      "text": "Fix the upload flow so that when 'START UPLOAD' is clicked, the chunking loop sends 1.8MB chunks directly to the backend Orchestrator's upload_chunk function (not to Sensory Cortex directly)",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "When \"START UPLOAD\" is clicked, execute the chunking loop, sending the 1.8MB chunks directly to the backend Orchestrator's upload_chunk function."
        ]
      },
      "acceptanceCriteria": [
        "The chunking loop calls the backend's upload_chunk function from The_Orchestrator actor",
        "Chunks are exactly 1,800,000 bytes in size",
        "Each chunk upload awaits confirmation before sending the next chunk",
        "No direct calls are made to a Sensory Cortex canister from the frontend"
      ]
    },
    {
      "id": "REQ-87",
      "text": "When the upload reaches 100% completion, call the backend Orchestrator's route_document(file.name, previewText) function where previewText is the first 5,000 characters extracted from the file",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "When the upload reaches 100%, call the backend Orchestrator's route_document(file.name, previewText) function."
        ]
      },
      "acceptanceCriteria": [
        "After all chunks upload successfully, route_document is called",
        "The first parameter is the file's name",
        "The second parameter is the previewText containing the first 5,000 characters of the file",
        "The route_document call targets The_Orchestrator backend actor"
      ]
    }
  ],
  "constraints": [
    "The entire application is already secured by Internet Identity - do not add additional authentication layers",
    "Route all file operations through The_Orchestrator backend, not directly to Sensory Cortex",
    "Maintain the existing sequential chunking engine with 1.8MB chunks",
    "Preserve the tactical dark aesthetic styling"
  ],
  "nonGoals": [
    "Adding new Principal ID input fields",
    "Creating direct communication between frontend and Sensory Cortex canister",
    "Modifying the chunking size from 1.8MB",
    "Changing the Internet Identity authentication flow"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}