{
  "kind": "build_request",
  "title": "Fix backend map persistence and remove access control traps",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "In backend/main.mo, locate the toggleAgentStatus function and change the map update logic from agents.add(agent.id, updatedAgent) to agents.put(agent.id, updatedAgent) to explicitly overwrite existing entries. If the Map implementation does not support .put(), use agents.remove(agent.id) immediately before agents.add(agent.id, updatedAgent) to ensure proper overwriting.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Fix the Map Persistence: In toggleAgentStatus, change agents.add(agent.id, updatedAgent); so it explicitly OVERWRITES the existing entry. Use agents.put(agent.id, updatedAgent);. If your specific Map implementation lacks .put, explicitly use agents.remove(agent.id); right before agents.add(...)."
        ]
      },
      "acceptanceCriteria": [
        "The toggleAgentStatus function uses agents.put() or agents.remove() + agents.add() pattern",
        "Agent status toggles persist correctly across function calls",
        "No duplicate or stale entries exist in the agents map"
      ]
    },
    {
      "id": "REQ-2",
      "text": "In backend/main.mo, remove all AccessControl trap blocks from every function including toggleAgentStatus, start_boardroom_debate, getStatus, and any other functions. Delete every if (not (AccessControl...)) { Runtime.trap(...) } statement to allow functions to execute without authentication checks.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Remove the Access Control Traps: You restored the AccessControl checks, which is locking the UI out. Delete every single if (not (AccessControl...)) { Runtime.trap(...) }; block from EVERY function (toggleAgentStatus, start_boardroom_debate, getStatus, etc.). Let them execute freely."
        ]
      },
      "acceptanceCriteria": [
        "No Runtime.trap() calls related to AccessControl remain in any function",
        "All backend functions execute without authentication barriers",
        "UI can successfully call backend functions without access control errors"
      ]
    }
  ],
  "constraints": [
    "Do not modify any frontend React files",
    "Only modify backend/main.mo",
    "Preserve all existing agent data and debate functionality"
  ],
  "nonGoals": [
    "Adding new features or functionality",
    "Refactoring unrelated code",
    "Modifying frontend components or hooks"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}