{
  "kind": "build_request",
  "title": "Fix React Error 185 infinite loop and hardcode backend debate response",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-140",
      "text": "In frontend/src/App.tsx, locate the Boardroom component render body and all useEffect hooks. Identify any state setter calls (setTranscript, setIsDebating, setIsRecording, or similar) that are being executed directly in the render body or inside a useEffect without a proper dependency array. Move all state updates to explicit event handlers (onClick, onSubmit, etc.) or wrap them in useEffect with strict dependency arrays like [] or [specificDependency].",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-critical-fix"
        ],
        "quotes": [
          "You are calling a state setter (like setTranscript, setIsDebating, or similar) directly in the main render body or inside a useEffect that is missing a dependency array.",
          "Ensure ALL state updates only happen inside explicit event handlers (e.g., triggered by onClick inside handlePushToTalk) or inside a useEffect with a strict dependency array like []."
        ]
      },
      "acceptanceCriteria": [
        "No state setter functions are called directly in the component render body",
        "All useEffect hooks have explicit dependency arrays",
        "React Error 185 (Maximum update depth exceeded) is resolved",
        "State updates only occur in event handlers or properly configured useEffect hooks"
      ]
    },
    {
      "id": "REQ-141",
      "text": "In backend/main.mo, locate the start_boardroom_debate function and replace the ENTIRE function body with exactly this code: public shared(msg) func start_boardroom_debate(prompt: Text) : async Text { return \"Skippy: This is a stubbed response.\\n\\nGLaDOS: This is a stubbed response.\\n\\nRobby: This is a stubbed response.\"; }; Do NOT add any other logic to this function. Remove all agent registry lookups, all is_enabled checks, all cross-canister calls, and all state updates. The function must ONLY return that exact hardcoded string.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-user-critical-fix"
        ],
        "quotes": [
          "Replace the ENTIRE start_boardroom_debate function in the Motoko backend (The_Orchestrator) with exactly this code",
          "Do NOT add any other logic to this function. Do not check the agent registry. Do not make cross-canister calls. Just return that exact string."
        ]
      },
      "acceptanceCriteria": [
        "start_boardroom_debate function body contains ONLY the return statement with the hardcoded string",
        "No agent registry lookups are performed in the function",
        "No cross-canister calls are made in the function",
        "No state updates to current_state are performed in the function",
        "Function returns the exact string: 'Skippy: This is a stubbed response.\\n\\nGLaDOS: This is a stubbed response.\\n\\nRobby: This is a stubbed response.'",
        "Backend fetch errors are resolved and the function returns cleanly to the frontend"
      ]
    }
  ],
  "constraints": [
    "Do not modify any other backend functions beyond start_boardroom_debate",
    "Do not change the function signature of start_boardroom_debate (must accept prompt: Text and return async Text)",
    "Do not add additional logic to start_boardroom_debate beyond the hardcoded return statement",
    "Ensure React state setters are never called in component render body"
  ],
  "nonGoals": [
    "Implementing actual multi-agent debate logic",
    "Restoring agent registry integration",
    "Adding new features to the debate system",
    "Modifying other components beyond fixing the infinite loop"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}