{
  "kind": "build_request",
  "title": "Boardroom Quality of Life Updates (Enter Key + Auto-scroll)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-4",
      "text": "Update the <Textarea> in the Boardroom Text Command Console (frontend/src/App.tsx) to add an onKeyDown event handler that prevents the default new line behavior when the Enter key is pressed without holding Shift, and instead triggers handleSendCommand() to submit the command.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-final"
        ],
        "quotes": [
          "Update the <Textarea> in the Text Command Console. Add an onKeyDown event so that pressing the \"Enter\" key (without holding Shift) prevents the default new line and triggers handleSendCommand()."
        ]
      },
      "acceptanceCriteria": [
        "Pressing Enter without Shift submits the command and clears the textarea",
        "Pressing Shift+Enter inserts a new line in the textarea",
        "The onKeyDown handler calls event.preventDefault() to block default Enter behavior before triggering handleSendCommand()"
      ]
    },
    {
      "id": "REQ-5",
      "text": "Implement auto-scroll in the DebateDisplay component (or the transcript container in frontend/src/App.tsx). Create a useRef pointing to an element at the bottom of the transcript container, and add a useEffect hook that smoothly scrolls that ref into view whenever debateState.transcript updates.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-final"
        ],
        "quotes": [
          "In the DebateDisplay (or the container holding the transcript), implement a standard React auto-scroll. Use a useRef at the bottom of the transcript container and a useEffect that scrolls that ref into view smoothly whenever debateState.transcript updates."
        ]
      },
      "acceptanceCriteria": [
        "A ref element is placed at the bottom of the transcript container",
        "A useEffect hook monitors debateState.transcript changes",
        "When transcript updates, the ref scrolls into view with smooth behavior",
        "The auto-scroll does not interfere with manual scrolling by the user"
      ]
    }
  ],
  "constraints": [
    "Do NOT modify, read, or rebuild backend/main.mo (Version 56 Golden Master)",
    "Only modify frontend files, specifically frontend/src/App.tsx or related Boardroom UI components",
    "Preserve all existing Boardroom functionality including Push-to-Talk and Send button"
  ],
  "nonGoals": [
    "Backend changes of any kind",
    "Changes to debate logic or agent behavior",
    "Command history or preset prompts",
    "Changes to authentication or identity management"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}