{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Remove Principal Input and Fix Upload Button in Sensory Cortex",
  "requirements": [
    {
      "id": "REQ-84",
      "summary": "Delete the entire 'SENSORY CORTEX CANISTER PRINCIPAL' input field and its associated state variable from the SensoryCortexTab component",
      "acceptanceCriteria": [
        "The Principal input field is completely removed from the UI",
        "All state variables related to Principal ID are deleted",
        "No visual trace of the Principal input remains in the Sensory Cortex tab"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/SensoryCortexTab.tsx",
          "operation": "modify",
          "description": "Remove the 'SENSORY CORTEX CANISTER PRINCIPAL' input field element and delete all associated state variables (e.g., sensoryCortexPrincipal, setSensoryCortexPrincipal) from the component. Remove any validation, error handling, or UI logic that references this Principal input field."
        }
      ]
    },
    {
      "id": "REQ-85",
      "summary": "Remove all validation logic that disables the 'START UPLOAD' button based on a Principal ID, ensuring the button is enabled only when a file is selected",
      "acceptanceCriteria": [
        "The START UPLOAD button is enabled when selectedFile is not null",
        "The START UPLOAD button is disabled only when no file is selected",
        "No Principal ID validation exists in the button's disabled logic"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/SensoryCortexTab.tsx",
          "operation": "modify",
          "description": "Update the 'START UPLOAD' button's disabled prop to only check if selectedFile is not null. Remove any conditions that reference Principal ID validation. The button should be disabled={!selectedFile} or disabled={selectedFile === null}."
        }
      ]
    },
    {
      "id": "REQ-86",
      "summary": "Fix the upload flow so that when 'START UPLOAD' is clicked, the chunking loop sends 1.8MB chunks directly to the backend Orchestrator's upload_chunk function",
      "acceptanceCriteria": [
        "The chunking loop calls the backend's upload_chunk function from The_Orchestrator actor",
        "Chunks are exactly 1,800,000 bytes in size",
        "Each chunk upload awaits confirmation before sending the next chunk",
        "No direct calls are made to a Sensory Cortex canister from the frontend"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/SensoryCortexTab.tsx",
          "operation": "modify",
          "description": "Modify the upload handler to chunk the selected file into 1,800,000-byte pieces and send each chunk sequentially to the backend actor's upload_chunk backend capability (available via useActor hook). Ensure each chunk upload awaits a response before proceeding to the next chunk. Remove any direct actor creation or Principal-based canister calls to Sensory Cortex. Use the existing actor from useActor to call the backend Orchestrator's methods."
        }
      ]
    },
    {
      "id": "REQ-87",
      "summary": "When the upload reaches 100% completion, call the backend Orchestrator's route_document function with file name and preview text (first 5,000 characters)",
      "acceptanceCriteria": [
        "After all chunks upload successfully, route_document is called",
        "The first parameter is the file's name",
        "The second parameter is the previewText containing the first 5,000 characters of the file",
        "The route_document call targets The_Orchestrator backend actor"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/SensoryCortexTab.tsx",
          "operation": "modify",
          "description": "After the chunking loop completes successfully (100% upload), extract the first 5,000 characters from the file content as previewText, then call actor.routeDocument(file.name, previewText, fileSize, sensoryCortexPrincipal) using the backend actor from useActor. Note: Based on the backend interface signature routeDocument(filename: string, filePreview: string, fileSize: bigint, sensoryCortex: Principal), you will need to pass the appropriate sensoryCortex Principal parameter as required by the backend - use a hardcoded or environment-configured Principal value since the user input is being removed."
        }
      ]
    }
  ]
}