{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Replace useActor.ts with dual-actor setup for telemetry",
  "requirements": [
    {
      "id": "REQ-21",
      "summary": "Replace the entire contents of frontend/src/hooks/useActor.ts with the user-provided template that implements dual-actor initialization for main orchestrator actor (Golden Master) and telemetry side master actor with defensive loading",
      "acceptanceCriteria": [
        "The file frontend/src/hooks/useActor.ts matches the user-provided template exactly",
        "The file imports createTelemetryActor from '../../../declarations/telemetry'",
        "The useActor hook initializes both the main actor (actorQuery) and telemetry actor (telemetryActorQuery) using separate React Query queries",
        "The telemetry actor query checks for CANISTER_ID_TELEMETRY or VITE_TELEMETRY_CANISTER_ID environment variables",
        "The telemetry actor query includes defensive error handling with console.warn and console.error",
        "The telemetry actor query returns null if canister ID is missing or initialization fails",
        "The useEffect hook invalidates and refetches dependent queries when actorQuery.data changes, excluding ACTOR_QUERY_KEY and TELEMETRY_QUERY_KEY",
        "The hook returns an object with actor, telemetryActor, and isFetching properties"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useActor.ts",
          "operation": "modify",
          "description": "Replace the entire file contents with the user-provided template that implements dual-actor initialization. The new implementation will: (1) Import createTelemetryActor from '../../../declarations/telemetry' alongside the existing createBackendActor import. (2) Define separate React Query queries for the main actor (ACTOR_QUERY_KEY) and telemetry actor (TELEMETRY_QUERY_KEY). (3) Initialize the telemetry actor with defensive checks for CANISTER_ID_TELEMETRY or VITE_TELEMETRY_CANISTER_ID environment variables, logging warnings if missing and returning null on initialization failures. (4) Maintain the existing useEffect hook that invalidates dependent queries when the main actor changes, ensuring it excludes both ACTOR_QUERY_KEY and TELEMETRY_QUERY_KEY from invalidation. (5) Return an object containing actor, telemetryActor, and isFetching properties. The template must be applied exactly as provided by the user with no modifications to logic, imports, or structure."
        }
      ]
    }
  ]
}