{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Restore Version 34 functionality",
  "requirements": [
    {
      "id": "REQ-168",
      "summary": "Remove transcript clearing on Push-to-Talk to allow transcript persistence across multiple recording sessions",
      "acceptanceCriteria": [
        "setTranscript([]) is removed from the Push-to-Talk handler",
        "Transcript content persists across multiple recordings",
        "New agent responses append to existing transcript without clearing"
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "In the handlePushToTalk function, remove the setTranscript([]) call that clears the transcript at the start of each recording. The transcript state should persist and accumulate across multiple Push-to-Talk sessions without being reset."
        }
      ]
    },
    {
      "id": "REQ-169",
      "summary": "Remove error handling wrapper from boardroom debate backend call to restore direct execution pattern",
      "acceptanceCriteria": [
        "try/catch/finally block is removed from the debate call",
        "backend.start_boardroom_debate() executes without error wrapper",
        "No finally block that resets loading state variables"
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "In the handlePushToTalk function, remove the try/catch/finally error handling wrapper from the backend.start_boardroom_debate() call. The function should call backend.start_boardroom_debate() directly without explicit error boundaries or finally blocks."
        }
      ]
    },
    {
      "id": "REQ-170",
      "summary": "Restore transcript dependency in speech synthesis useEffect to trigger properly on transcript updates",
      "acceptanceCriteria": [
        "useEffect dependency array includes transcript variable",
        "Speech synthesis triggers properly when transcript updates",
        "Component responds to transcript changes as expected"
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Locate the useEffect hook that manages SpeechSynthesis or transcript updates and restore the transcript state variable to its dependency array. This ensures speech synthesis triggers properly when the transcript changes."
        }
      ]
    },
    {
      "id": "REQ-171",
      "summary": "Change Push-to-Talk button onClick handler to use direct function reference instead of arrow function wrapper",
      "acceptanceCriteria": [
        "Button uses onClick={handleSpeech} syntax",
        "Arrow function wrapper is removed",
        "Handler executes when button is clicked"
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Change the Push-to-Talk button onClick handler from arrow function syntax (onClick={() => handleSpeech()}) to direct function reference syntax (onClick={handleSpeech}). Remove the arrow function wrapper so the handler is triggered directly."
        }
      ]
    }
  ]
}